solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
/*
 * Copyright 2023-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_pca9422.h"
#include "fsl_power.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#if (defined(PCA9422_DEVIC_ID_PCA9422A) && PCA9422_DEVIC_ID_PCA9422A != 0U)
#define DEVICE_ID_PCA9422A
#else
#define DEVICE_ID_PCA9422B
#endif /* PCA9422_DEVIC_ID */

#if defined(FSL_DEBUG_PMIC_DRIVER) && (FSL_DEBUG_PMIC_DRIVER != 0U)
#include "fsl_debug_console.h"
#define LOG_INFO PRINTF
#else
#define LOG_INFO(...)
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static uint64_t pca9422_ffs(uint64_t word);

#define MASK2SHIFT(_mask) pca9422_ffs(_mask)
/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
static uint64_t pca9422_ffs(uint64_t word)
{
    uint32_t num = 0U;

    if ((word & 0xffffffffU) == 0U)
    {
        num += 32U;
        word >>= 32U;
    }
    if ((word & 0xffffU) == 0U)
    {
        num += 16U;
        word >>= 16U;
    }
    if ((word & 0xffU) == 0U)
    {
        num += 8U;
        word >>= 8U;
    }
    if ((word & 0xfU) == 0U)
    {
        num += 4U;
        word >>= 4U;
    }
    if ((word & 0x3U) == 0U)
    {
        num += 2U;
        word >>= 2U;
    }
    if ((word & 0x1U) == 0U)
    {
        num += 1U;
    }
    return (uint64_t)num;
}

void PCA9422_GetChargerDefaultConfig(pca9422_charger_config_t *config)
{
    assert(config);

    /* Set callback function to NULL Pointer. */
    config->I2C_SendFunc    = NULL;
    config->I2C_ReceiveFunc = NULL;

    /* Precharge current set to 17% of fast charge current. */
    config->prechgI = kPCA9422_PrechgI17percent;
    /* Current step is 2.5mA. */
    config->chgIStep = kPCA9422_ChgIStep2p5mA;
    /* Top-off current is 2.5% of fast charge current. */
    config->topoffI = kPCA9422_TopoffI2p5percent;
    /* Fast charge current is 100mA. */
    config->fastI = 100U;
    /* VBAT regulation voltage is 4200mV. */
    config->vbatReg = 4200U;
    /* Recharge voltage threshold is [VBAT_REG - 100mV]. */
    config->rechgVolt = kPCA9422_RechargeTh100mV;
    /* Precharge timer is 30minutes. */
    config->prechgTime = kPCA9422_PrechgTimer30min;
    /* Fast charge timer is 3hours. */
    config->fastchgTime = kPCA9422_FastchgTimer3h;
    /* Top-off timer is 5minutes. */
    config->topoffTime = kPCA9422_TopoffTimer5min;
    /* Warm(40C) voltage threshold is 32.63% of VL. */
    config->warmVolt = kPCA9422_Vwarm45C32p63percent;
    /* Warm Plus(50C) voltage threshold is 29.07% of VL. */
    config->warmPlusVolt = kPCA9422_Vwarm50C29p07percent;
    /* Hot(60C) voltage threshold is 22.94% of VL. */
    config->hotVolt = kPCA9422_Vhot60C22p94percent;
    /* Cool(10C) voltage threshold is 64.82% of VL. */
    config->coolVolt = kPCA9422_Vcool10C64p82percent;
    /* Cold(0C) voltage threshold is 74.18% of VL. */
    config->coldVolt = kPCA9422_Vcold0C74p18percent;
    /* New VBAT_REG voltage at WARM(40C) stays VBAT_REG. */
    config->warmVbatReg = kPCA9422_NewVbat45C_StayVbatReg;
    /* New VBAT_REG voltage at WARM_PLUS(50C) stays VBAT_REG. */
    config->warmPlusVbatReg = kPCA9422_NewVbat50C_StayVbatReg;
    /* New I_VBAT current at COOL(10C) stays I_FAST_CHG. */
    config->coldIVbat = kPCA9422_NewIVbat10C_StayIFastchg;
    /* New I_VBAT current at WARM(45C) stays I_FAST_CHG. */
    config->warmIVbat = kPCA9422_NewIVbat45C_StayIFastchg;
    /* New I_VBAT current at WARM_PLUS(50C) stays I_FAST_CHG. */
    config->warmPlusIVbat = kPCA9422_NewIVbat50C_StayIFastchg;
    /* AICL threshold on CHGIN is 4.5V. */
    config->aiclV = kPCA9422_AICLV4p5V;
    /* Input current limit on VIN is 470mA. */
    config->icl = kPCA9422_VinIlim_470mA;
    /* VSYS regulation voltage is 4550mV. */
    config->vsysReg = 4550U;
    /* AMUX wait time */
    config->amuxWaitTime = kPCA9422_AMUXAutoOffWait_256us;
    /* AMUX mode */
    config->amuxMode = kPCA9422_AMUXModeManual;
    /* VBAT/VSYS channel scale factor */
    config->amuxVbatGain = kPCA9422_AMUXVbatVsysGain_1dvd3;
    /* THERM and THERM_BIAS channels scale factor */
    config->amuxThermGain = kPCA9422_AMUXThermGain_1;
    /* AMUX channel */
    config->amuxChannel = kPCA9422_AMUXChannel_Off;
    /* I2C slave address. */
    config->slaveAddress = PCA9422_DEFAULT_I2C_ADDR;
}

void PCA9422_InitCharger(pca9422_handle_t *handle, const pca9422_charger_config_t *config)
{
    uint8_t chgCntl[11], vinCntl[4], regVal;
    bool result;

    assert(handle);
    assert(config);

    /* Initialize Callback functions. */
    handle->I2C_SendFunc    = config->I2C_SendFunc;
    handle->I2C_ReceiveFunc = config->I2C_ReceiveFunc;
    /* Set Slave Address. */
    handle->slaveAddress = config->slaveAddress;

    /* Initialize Charger control registers */
    chgCntl[0] = PCA9422_CHARGER_LOCK_UNLOCK;
    chgCntl[1] = (uint8_t)(PCA9422_CHARGER_CNTL_1_AUTOSTOP_CHG_EN | PCA9422_CHARGER_CNTL_1_CHARGER_EN |
                           (uint8_t)config->warmPlusVolt | (uint8_t)config->prechgI | (uint8_t)config->chgIStep);
    chgCntl[2] = (uint8_t)(PCA9422_VBAT_REG(config->vbatReg));
    chgCntl[3] = (uint8_t)PCA9422_I_FAST_CHG_DFT;
    chgCntl[4] = (uint8_t)((uint8_t)config->rechgVolt | (uint8_t)config->topoffI | (uint8_t)config->prechgTime);
    chgCntl[5] = (uint8_t)PCA9422_CHARGER_CNTL_5_DFT;
    chgCntl[6] = (uint8_t)((uint8_t)config->hotVolt | (uint8_t)config->warmVolt | (uint8_t)config->coolVolt |
                           (uint8_t)config->coldVolt);
    chgCntl[7] = (uint8_t)(PCA9422_CHARGER_CNTL_7_CHG_DISABLE_AT_COLD_HOT_EN | (uint8_t)config->fastchgTime |
                           (uint8_t)config->coldIVbat | (uint8_t)config->warmVbatReg);
    chgCntl[8] = (uint8_t)(config->topoffTime);
    chgCntl[9] =
        (uint8_t)((uint8_t)config->warmPlusVbatReg | (uint8_t)config->warmPlusIVbat | (uint8_t)config->warmIVbat);
    chgCntl[10] = (uint8_t)((uint8_t)config->amuxWaitTime | (uint8_t)config->amuxMode | (uint8_t)config->amuxVbatGain |
                            (uint8_t)config->amuxThermGain | (uint8_t)config->amuxChannel);

