solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, chgCntl, sizeof(chgCntl));
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = result ? PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U) : result;
    if (!result)
    {
        assert(false);
    }

    vinCntl[0] = (uint8_t)PCA9422_VIN_CNTL_0_VIN_PD_EN;
    vinCntl[1] = (uint8_t)((uint8_t)config->aiclV | PCa9422_VIN_CNTL_1_AICL_EN);
    vinCntl[2] = (uint8_t)(config->icl);
    vinCntl[3] = (uint8_t)(PCA9422_VSYS_REG(config->vsysReg) << MASK2SHIFT(PCA9422_VIN_CNTL_3_VSYS_REG));
    result       = PCA9422_WriteRegs(handle, PCA9422_VIN_CNTL_0, vinCntl, sizeof(vinCntl));
    if (!result)
    {
        assert(false);
    }
}

bool PCA9422_SetPreChargeCurrent(pca9422_handle_t *handle, uint8_t iPrechg)
{
    uint8_t regVal;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Set precharge current */
    regVal = iPrechg;
    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL1, PCA9422_CHARGER_CNTL_1_PRECHG_CURRENT, regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

uint8_t PCA9422_GetPreChargeCurrent(pca9422_handle_t *handle)
{
    uint8_t regVal;
    uint8_t iPrechg;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("Error in I2C operation in %s.", __func__);
    }

    /* Read CHG_CNTL_1 */
    result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL1, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("Error in I2C operation in %s.", __func__);
    }
    iPrechg = (regVal & PCA9422_CHARGER_CNTL_1_PRECHG_CURRENT);

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("Error in I2C operation in %s.", __func__);
    }

    return iPrechg;
}

bool PCA9422_SetTopoffCurrent(pca9422_handle_t *handle, uint8_t iTopoff)
{
    uint8_t regVal;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Set topoff current */
    regVal = iTopoff;
    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL4, PCA9422_CHARGER_CNTL_4_TOPOFF_CURRENT, regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

uint8_t PCA9422_GetTopoffCurrent(pca9422_handle_t *handle)
{
    uint8_t regVal;
    uint8_t iTopoff = 0U;
    bool result;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == true)
    {
        /* Read CHG_CNTL_4 */
        result  = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL4, &regVal, 1U);
        iTopoff = (regVal & PCA9422_CHARGER_CNTL_4_TOPOFF_CURRENT);
    }
    if (result == true)
    {
        /* Write CHARGER_LOCK bit */
        regVal = PCA9422_CHARGER_LOCK_LOCK;
        result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    }
    assert(result == true);

    return iTopoff;
}

bool PCA9422_SetFastChargeCurrent(pca9422_handle_t *handle, uint16_t iFast)
{
    uint8_t currStep;
    uint8_t regVal;
    bool result;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Check charging current */
    if (iFast > 320U * 10U)
    {
        /* Set current step to 5mA */
        regVal = (uint8_t)kPCA9422_ChgIStep5p0mA;
    }
    else
    {
        /* Set current step to 2.5mA */
        regVal = (uint8_t)kPCA9422_ChgIStep2p5mA;
    }
    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL1, PCA9422_CHARGER_CNTL_1_CHG_CURRENT_STEP, regVal);
    if (result == false)
    {
        goto error;
    }
    /* Get current step */
    currStep = (regVal == (uint8_t)kPCA9422_ChgIStep5p0mA) ? 50U : 25U;
    regVal   = (uint8_t)((iFast - currStep) / currStep);

    /* Set I_FAST_CHG */
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL3, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

uint16_t PCA9422_GetFastChargeCurrent(pca9422_handle_t *handle)
{
    uint8_t currStep;
    uint8_t regVal;
    uint16_t iFastReg;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("Error in I2C operation in %s.", __func__);
    }

    /* Get current step */
    /* Read CHG_CNTL_1 */
    result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL1, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("Error in I2C operation in %s.", __func__);
    }
    currStep = ((regVal & PCA9422_CHARGER_CNTL_1_CHG_CURRENT_STEP) != 0U) ? 50U : 25U;

    /* Read CHG_CNTL_3 */
    result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL3, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("Error in I2C operation in %s.", __func__);
    }
    iFastReg = (uint16_t)regVal * currStep + (uint16_t)currStep;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("Error in I2C operation in %s\r\n", __func__);
    }

    return iFastReg;
}

uint16_t PCA9422_GetChargeCurrent(pca9422_handle_t *handle)
{
    uint8_t chgSts[4];
    uint8_t regVal, regBit = 0U;
    uint16_t iCharge;
    uint8_t preChgCurr[2] = {10U, 20U};            /* 10%, 20% */
    uint8_t topOffCurr[4] = {25U, 50U, 75U, 100U}; /* 2.5%, 5.0%, 7.5%, 10.0% */
    uint8_t thermCurr[4]  = {100U, 75U, 50U, 25U}; /* 1.0, 0.75, 0.5, 0.25 */
    float tempVal;
    bool result;

    /* Read CHARGER_0_STS ~ CHARGER_3_STS */
    result = PCA9422_ReadRegs(handle, PCA9422_CHARGER_0_STS, chgSts, 4U);
    assert(result);

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    assert(result);

    /* Get fast charge current */
    iCharge = PCA9422_GetFastChargeCurrent(handle) / 10U;

    /* Check Charge state first */
    /* Check CHARGER_0_STS */
    if ((chgSts[0] & PCA9422_INT_CHARGER_0_CHG_QUAL_OK) != 0U)
    {
        /* Qualification process for charging passed */
        /* Charging */
        if ((chgSts[0] & PCA9422_INT_CHARGER_0_FAST_CHARGE) != 0U)
        {
            /* Keep iCharge */
        }
        else if ((chgSts[0] & PCA9422_INT_CHARGER_0_CV_MODE) != 0U)
        {
            /* Keep iCharge */
        }
        else if ((chgSts[0] & PCA9422_INT_CHARGER_0_TOPOFF) != 0U)
        {
            /* Read topoff current */
            /* Read CHG_CNTL_4 */
            result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL4, &regVal, 1U);
            assert(result);
            regBit =
                (regVal & PCA9422_CHARGER_CNTL_4_TOPOFF_CURRENT) >> MASK2SHIFT(PCA9422_CHARGER_CNTL_4_TOPOFF_CURRENT);
            tempVal = (float)iCharge * (float)topOffCurr[regBit] / 10.0f / 100.0f;
            iCharge = (uint16_t)tempVal;
        }
        else if ((chgSts[0] & PCA9422_INT_CHARGER_0_PRECHARGE) != 0U)
        {
            /* Read precharge current */
            /* Read CHG_CNTL_1 */
            result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL1, &regVal, 1U);
            assert(result);
            regBit =
                (regVal & PCA9422_CHARGER_CNTL_1_PRECHG_CURRENT) >> MASK2SHIFT(PCA9422_CHARGER_CNTL_1_PRECHG_CURRENT);
            tempVal = (float)iCharge * (float)preChgCurr[regBit] / 100.0f;
            iCharge = (uint16_t)tempVal;
        }
        else
        {
            /* iCharge */
            iCharge = 0U;
        }
    }
    else
    {
        iCharge = 0U;
    }

    /* Check whether JEITA function is enabled or not */
    /* Read CHG_CNTL_5 */
    result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL5, &regVal, 1U);
    assert(result);
    /* Check THERM_NTC_EN bit */
    if (((regVal & PCA9422_CHARGER_CNTL_5_THERM_NTC_EN) != 0U) && (iCharge != 0U))
    {
        /* Use JEITA function */
        /* Check JEITA interrupt happens */
        if ((chgSts[1] & PCA9422_INT_CHARGER_1_THERM_HOT) != 0U)
        {
            iCharge = 0U;
        }
        else if ((chgSts[1] & PCA9422_INT_CHARGER_1_THERM_WARM_PLUS) != 0U)
        {
            /* NEW_I_VBAT_AT_50C */
            /* Read CHG_CNTL_9 */
            result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL9, &regVal, 1U);
            assert(result);
            regBit = (regVal & PCA9422_CHARGER_CNTL_9_NEW_I_VBAT_AT_50C) >>
                     MASK2SHIFT(PCA9422_CHARGER_CNTL_9_NEW_I_VBAT_AT_50C);
            tempVal = (float)iCharge * (float)thermCurr[regBit] / 100.0f;
            iCharge = (uint16_t)tempVal;
        }
        else if ((chgSts[1] & PCA9422_INT_CHARGER_1_THERM_WARM) != 0U)
        {
            /* NEW_I_VBAT_AT_45C */
            /* Read CHG_CNTL_9 */
            result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL9, &regVal, 1U);
            assert(result);
            regBit = (regVal & PCA9422_CHARGER_CNTL_9_NEW_I_VBAT_AT_45C) >>
                     MASK2SHIFT(PCA9422_CHARGER_CNTL_9_NEW_I_VBAT_AT_45C);
            tempVal = (float)iCharge * (float)thermCurr[regBit] / 100.0f;
            iCharge = (uint16_t)tempVal;
        }
        else if ((chgSts[1] & PCA9422_INT_CHARGER_1_THERM_COOL) != 0U)
        {
            /* NEW_I_VBAT_AT_10C */
            /* Read CHG_CNTL_7 */
            result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL7, &regVal, 1U);
            assert(result);
            regBit = (regVal & PCA9422_CHARGER_CNTL_7_NEW_I_VBAT_AT_10C) >>
                     MASK2SHIFT(PCA9422_CHARGER_CNTL_7_NEW_I_VBAT_AT_10C);
            tempVal = (float)iCharge * (float)thermCurr[regBit] / 100.0f;
            iCharge = (uint16_t)tempVal;
        }
        else if ((chgSts[1] & PCA9422_INT_CHARGER_1_THERM_COLD) != 0U)
        {
            iCharge = 0U;
        }
        else if ((chgSts[1] & PCA9422_INT_CHARGER_1_VBAT_OVP) != 0U)
        {
            iCharge = 0U;
        }
        else if ((chgSts[1] & PCA9422_INT_CHARGER_1_NO_BATTERY) != 0U)
        {
            iCharge = 0U;
        }
        else
        {
            /* PCA9422_INT_CHARGER_1_VBAT_OVP - Keep iCharge */
        }
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    assert(result);

    return (result ? iCharge : 0U);
}

uint16_t PCA9422_GetVBATRegulation(pca9422_handle_t *handle)
{
    uint8_t chgSts[4];
    uint8_t regVal = 0U;
    uint8_t regBit = 0U;
    uint16_t vFloat;
    uint8_t newVbatOffset[4] = {0U, 100U, 150U, 200U}; /* 0, 100mV, 150mV, 200mV */
    bool result              = true;

