solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
    /* Write CHARGER_LOCK bit to UNLOCK */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        vFloat = 0U;
        goto error;
    }

    /* Read CHG_CNTL_2 */
    result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL2, &regVal, 1U);
    if (result == false)
    {
        vFloat = 0U;
        goto error;
    }
    /* Convert reg value to vFloat */
    vFloat = (uint16_t)regVal * PCA9422_VBAT_REG_STEP + PCA9422_VBAT_REG_MIN;

    /* Check JEITA condition */
    /* Read CHARGER_0_STS ~ CHARGER_3_STS */
    result = PCA9422_ReadRegs(handle, PCA9422_CHARGER_0_STS, chgSts, 4U);
    if (result == false)
    {
        vFloat = 0U;
        goto error;
    }

    /* Check whether JEITA function is enabled or not */
    /* Read CHG_CNTL_5 */
    result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL5, &regVal, 1U);
    if (result == false)
    {
        vFloat = 0U;
        goto error;
    }
    /* Check THERM_NTC_EN bit */
    if ((regVal & PCA9422_CHARGER_CNTL_5_THERM_NTC_EN) != 0U)
    {
        /* Use JEITA function */
        /* Check JEITA interrupt happens */
        if ((chgSts[1] & PCA9422_INT_CHARGER_1_THERM_WARM_PLUS) != 0U)
        {
            /* NEW_VBAT_AT_50C */
            /* Read CHG_CNTL_9 */
            result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL9, &regVal, 1U);
            if (result == false)
            {
                vFloat = 0U;
                goto error;
            }
            regBit =
                (regVal & PCA9422_CHARGER_CNTL_9_NEW_VBAT_AT_50C) >> MASK2SHIFT(PCA9422_CHARGER_CNTL_9_NEW_VBAT_AT_50C);
            vFloat = vFloat - newVbatOffset[regBit];
        }
        else if ((chgSts[1] & PCA9422_INT_CHARGER_1_THERM_WARM) != 0U)
        {
            /* NEW_VBAT_AT_45C */
            /* Read CHG_CNTL_7 */
            result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL7, &regVal, 1U);
            if (result == false)
            {
                vFloat = 0U;
                goto error;
            }
            regBit =
                (regVal & PCA9422_CHARGER_CNTL_7_NEW_VBAT_AT_45C) >> MASK2SHIFT(PCA9422_CHARGER_CNTL_7_NEW_VBAT_AT_45C);
            vFloat = vFloat - newVbatOffset[regBit];
        }
        else
        {
            /* No Charge or Keep Vreg */
        }
    }

    /* Write CHARGER_LOCK bit to LOCK */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        vFloat = 0U;
    }

error:
    return vFloat;
}

bool PCA9422_SetVBATRegulation(pca9422_handle_t *handle, uint16_t vFloat)
{
    uint8_t regVal = 0U;
    uint16_t vSys  = 0U;
    bool result    = true;

    /* Check maximum VFLOAT */
    if (vFloat > PCA9422_VBAT_REG_MAX)
    {
        vFloat = PCA9422_VBAT_REG_MAX;
    }
    /* First, set new VSYS_REG */
    vSys = vFloat + PCA9422_VBAT_CLAMP_OFFSET;
    if (vSys < PCA9422_VSYS_REG_MIN)
    {
        vSys = PCA9422_VSYS_REG_MIN;
    }
    /* Convert vSys to reg value */
    regVal = (uint8_t)PCA9422_VSYS_REG(vSys);
    result = PCA9422_ModifyRegReadback(handle, PCA9422_VIN_CNTL_3, PCA9422_VIN_CNTL_3_VSYS_REG,
                                       regVal << MASK2SHIFT(PCA9422_VIN_CNTL_3_VSYS_REG));
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit to UNLOCK */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Convert vFloat to reg value */
    regVal = (uint8_t)PCA9422_VBAT_REG(vFloat);
    result = PCA9422_WriteRegsReadback(handle, PCA9422_CHG_CNTL2, &regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit to LOCK */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

bool PCA9422_SetRechargeThreshold(pca9422_handle_t *handle, uint8_t rechgTh)
{
    uint8_t regVal;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Set recharge threshold */
    regVal = rechgTh;
    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL4, PCA9422_CHARGER_CNTL_4_RECHARGE_TH, regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

bool PCA9422_SetPrechargeTimer(pca9422_handle_t *handle, uint8_t tPrechg)
{
    uint8_t regVal;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Set precharge timer */
    regVal = tPrechg;
    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL4, PCA9422_CHARGER_CNTL_4_PRE_CHG_TIMER, regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

bool PCA9422_SetFastchargeTimer(pca9422_handle_t *handle, uint8_t tFastchg)
{
    uint8_t regVal;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Set fast charge timer */
    regVal = tFastchg;
    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL7, PCA9422_CHARGER_CNTL_7_FAST_CHG_TIMER, regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

