solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
bool PCA9422_SetTopoffTimer(pca9422_handle_t *handle, uint8_t tTopoff)
{
    uint8_t regVal;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    /* Set fast charge timer */
    regVal = tTopoff;
    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL8, PCA9422_CHARGER_CNTL_8_TOP_OFF_TIMER, regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

uint8_t PCA9422_GetChargeState(pca9422_handle_t *handle)
{
    uint8_t chgSts = 0U;
    uint8_t regVal[4];
    bool result = true;

    /* Read CHARGER_0_STS ~ CHARGER_3_STS */
    result = PCA9422_ReadRegs(handle, PCA9422_CHARGER_0_STS, regVal, 4U);
    if (result == false)
    {
        chgSts = 0x00U;
        goto error;
    }

    /* Check CHARGER_0_STS */
    if ((regVal[0] & PCA9422_INT_CHARGER_0_CHG_QUAL_OK) != 0U)
    {
        /* Qualification process for charging passed */
        /* Charging */
        if (((regVal[0] & PCA9422_INT_CHARGER_0_CV_MODE) != 0U) || ((regVal[0] & PCA9422_INT_CHARGER_0_TOPOFF) != 0U))
        {
            chgSts = 0x03U; /* CV mode - CV or TOPOFF */
        }
        else if (((regVal[0] & PCA9422_INT_CHARGER_0_FAST_CHARGE) != 0U) ||
                 ((regVal[0] & PCA9422_INT_CHARGER_0_PRECHARGE) != 0U))
        {
            chgSts = 0x01U; /* CC mode - FAST CHARGE or PRE-CHARGE */
        }
        else
        {
            chgSts = 0x00U; /* Not charging */
        }

        /* Check CHARGER_2_STS */
        if ((regVal[2] & PCA9422_INT_CHARGER_2_CHARGE_DONE) != 0U)
        {
            chgSts = 0x04U;
        }
    }
    else
    {
        /* Any charge fault condition happens or No charge */
        chgSts = 0x00U;
    }

error:
    return chgSts;
}

void PCA9422_SelectAMUXChannel(pca9422_handle_t *handle, pca9422_amux_channel_t amuxCh)
{
    uint8_t regVal;
    bool result = true;
    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("I2C operation error in %s\r\n", __func__);
    }

    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL10, PCA9422_CHARGER_CNTL_10_AMUX_CHANNEL, (uint8_t)amuxCh);
    if (!result)
    {
        LOG_INFO("I2C operation error in %s\r\n", __func__);
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("I2C operation error in %s\r\n", __func__);
    }
}

void PCA9422_SetAMUXMode(pca9422_handle_t *handle, pca9422_amux_mode_t mode)
{
    uint8_t regVal;
    bool result = true;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("I2C operation error in %s\r\n", __func__);
    }

    result = PCA9422_ModifyReg(handle, PCA9422_CHG_CNTL10, PCA9422_CHARGER_CNTL_10_AMUX_MODE, (uint8_t)mode);
    if (!result)
    {
        LOG_INFO("I2C operation error in %s\r\n", __func__);
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        LOG_INFO("I2C operation error in %s\r\n", __func__);
    }
}

pca9422_amux_mode_t PCA9422_GetAMUXMode(pca9422_handle_t *handle)
{
    bool result;
    uint8_t regVal;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        assert(false);
    }

    result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL10, &regVal, 1U);
    if (!result)
    {
        assert(false);
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

    if (!result)
    {
        assert(false);
    }

    regVal = regVal & PCA9422_CHARGER_CNTL_10_AMUX_MODE;
    return (pca9422_amux_mode_t)regVal;
}

bool PCA9422_SetAMUXConfig(pca9422_handle_t *handle, pca9422_amux_config_t config)
{
    bool result;
    uint8_t regVal;

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (!result)
    {
        return result;
    }

    regVal = (uint8_t)(config.waitTime | config.amuxMode | config.vbatGain | config.thermGain | config.amuxChannel);
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL10, &regVal, 1U);
    if (!result)
    {
        return result;
    }

    /* Write CHARGER_LOCK bit */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

    return result;
}

float PCA9422_GetAMUXScaleFactor(pca9422_handle_t *handle, pca9422_amux_channel_t channel)
{
    float scaleFactor;
    uint8_t regVal;

    switch (channel)
    {
        case kPCA9422_AMUXChannel_Off:
            scaleFactor = 0.0f;
            break;
        case kPCA9422_AMUXChannel_Vbat:
        case kPCA9422_AMUXChannel_Vsys:
            /* Get scale factor */
            (void)PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL10, &regVal, 1U);
            scaleFactor = ((regVal & PCA9422_CHARGER_CNTL_10_AMUX_VBAT_VSYS_GAIN) != 0U) ? 4.0f : 3.0f;
            break;
        case kPCA9422_AMUXChannel_Therm:
        case kPCA9422_AMUXChannel_ThermBias:
            /* Get scale factor */
            (void)PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL10, &regVal, 1U);
            scaleFactor = ((regVal & PCA9422_CHARGER_CNTL_10_AMUX_THERM_GAIN) != 0U) ? 1.5f : 1.0f;
            break;
        case kPCA9422_AMUXChannel_Vin:
            scaleFactor = 4.0f;
            break;
        default:
            scaleFactor = 0.0f;
            break;
    }
    return scaleFactor;
}

