solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
bool PCA9422_SetEnableCharge(pca9422_handle_t *handle, bool enable)
{
    uint8_t regVal = 0U;
    bool result;

    /* Write CHARGER_LOCK bit to UNLOCK */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    if (enable == true)
    {
        /* Read USB_SUSPEND bit first */
        result = PCA9422_ReadRegs(handle, PCA9422_CHG_CNTL9, &regVal, 1U);
        if (result && ((regVal & PCA9422_CHARGER_CNTL_9_USB_SUSPEND) != 0U))
        {
            /* Disable suspend Mode first */
            regVal = 0U;
            result = PCA9422_ModifyRegReadback(handle, PCA9422_CHG_CNTL9, PCA9422_CHARGER_CNTL_9_USB_SUSPEND, regVal);
            if (result == false)
            {
                goto error;
            }
        }
    }

    regVal = (enable == true) ? PCA9422_CHARGER_CNTL_1_CHARGER_EN : 0U;
    result = PCA9422_ModifyRegReadback(handle, PCA9422_CHG_CNTL1, PCA9422_CHARGER_CNTL_1_CHARGER_EN, regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit to LOCK */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

bool PCA9422_SetUSBSuspendMode(pca9422_handle_t *handle, bool enable)
{
    uint8_t regVal = 0U;
    bool result;

    /* Write CHARGER_LOCK bit to UNLOCK */
    regVal = PCA9422_CHARGER_LOCK_UNLOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);
    if (result == false)
    {
        goto error;
    }

    regVal = (enable == true) ? PCA9422_CHARGER_CNTL_9_USB_SUSPEND : 0U;
    result = PCA9422_ModifyRegReadback(handle, PCA9422_CHG_CNTL9, PCA9422_CHARGER_CNTL_9_USB_SUSPEND, regVal);
    if (result == false)
    {
        goto error;
    }

    /* Write CHARGER_LOCK bit to LOCK */
    regVal = PCA9422_CHARGER_LOCK_LOCK;
    result = PCA9422_WriteRegs(handle, PCA9422_CHG_CNTL0, &regVal, 1U);

error:
    return result;
}

/*!
 * @name Regulator Functions
 * @{
 */
void PCA9422_GetDefaultBuckConfig(pca9422_buck_config_t *buckCfg)
{
    /* Buck1/2/3 default configuration */
    /* BUCK1 default configuration */
    buckCfg[0].dvsUpStep    = 0U; /* 6.25mV */
    buckCfg[0].dvsDnStep    = 0U; /* 6.25mV */
    buckCfg[0].dvsCtrl      = (uint8_t)kPCA9422_DVS0thrI2CInActiveAndSleep;
    buckCfg[0].rampSpeed    = kPCA9422_BxRamp_25mVp2us;
    buckCfg[0].lpMode       = kPCA9422_BxLPmodeNormal;
    buckCfg[0].activeDischg = kPCA9422_BxADEnabled;
    buckCfg[0].fpwmEn       = kPCA9422_BxAutoPFMandPWM;
    buckCfg[0].enMode       = kPCA9422_EnmodeOnAll;
    buckCfg[0].dvsVout[0]   = 1000000U; /* 1.0V */
    buckCfg[0].dvsVout[1]   = 1000000U; /* 1.0V */
    buckCfg[0].dvsVout[2]   = 1000000U; /* 1.0V */
    buckCfg[0].dvsVout[3]   = 1000000U; /* 1.0V */
    buckCfg[0].dvsVout[4]   = 1000000U; /* 1.0V */
    buckCfg[0].dvsVout[5]   = 1000000U; /* 1.0V */
    buckCfg[0].dvsVout[6]   = 1000000U; /* 1.0V */
    buckCfg[0].dvsVout[7]   = 1000000U; /* 1.0V */
    buckCfg[0].stbyVout     = 1000000U; /* 1.0V */
    buckCfg[0].maxVout      = 1200000U; /* 1.2V */
    buckCfg[0].sleepVout    = 400000U;  /* 0.4V */

    /* BUCK2 default configuration */
    buckCfg[1].dvsUpStep    = 0U; /* 25mV */
    buckCfg[1].dvsDnStep    = 0U; /* 25mV */
    buckCfg[1].dvsCtrl      = (uint8_t)kPCA9422_DVS0thrI2CInActiveAndSleep;
    buckCfg[1].rampSpeed    = kPCA9422_BxRamp_25mVp2us;
    buckCfg[1].lpMode       = kPCA9422_BxLPmodeNormal;
    buckCfg[1].activeDischg = kPCA9422_BxADEnabled;
    buckCfg[1].fpwmEn       = kPCA9422_BxAutoPFMandPWM;
    buckCfg[1].enMode       = kPCA9422_EnmodeOnAll;
#if defined(DEVICE_ID_PCA9422A)
    buckCfg[1].dvsVout[0]   = 1000000U; /* 1.0V */
#else
    buckCfg[1].dvsVout[0]   = 1100000U; /* 1.1V */
#endif
    buckCfg[1].dvsVout[1]   = 1000000U; /* 1.0V */
    buckCfg[1].dvsVout[2]   = 1000000U; /* 1.0V */
    buckCfg[1].dvsVout[3]   = 1000000U; /* 1.0V */
    buckCfg[1].dvsVout[4]   = 1000000U; /* 1.0V */
    buckCfg[1].dvsVout[5]   = 1000000U; /* 1.0V */
    buckCfg[1].dvsVout[6]   = 1000000U; /* 1.0V */
    buckCfg[1].dvsVout[7]   = 1000000U; /* 1.0V */
    buckCfg[1].stbyVout     = 1000000U; /* 1.0V */
#if defined(DEVICE_ID_PCA9422A)
    buckCfg[1].maxVout      = 1200000U;	/* 1.2V */
#else
    buckCfg[1].maxVout      = 1400000U; /* 1.4V */
#endif
    buckCfg[1].sleepVout    = 400000U;  /* 0.4V */

    /* BUCK3 default configuration */
    buckCfg[2].dvsUpStep    = 0U; /* 25mV */
    buckCfg[2].dvsDnStep    = 0U; /* 25mV */
    buckCfg[2].dvsCtrl      = kPCA9422_DVS0thrI2CInActiveAndSleep;
    buckCfg[2].rampSpeed    = kPCA9422_BxRamp_25mVp2us;
    buckCfg[2].lpMode       = kPCA9422_BxLPmodeNormal;
    buckCfg[2].activeDischg = kPCA9422_BxADEnabled;
    buckCfg[2].fpwmEn       = kPCA9422_BxAutoPFMandPWM;
    buckCfg[2].enMode       = kPCA9422_EnmodeOnAll;
#if defined(DEVICE_ID_PCA9422A)
    buckCfg[2].dvsVout[0]   = 1800000U; /* 1.8V */
#else
    buckCfg[2].dvsVout[0]   = 1000000U; /* 1.0V */
#endif
    buckCfg[2].dvsVout[1]   = 1000000U; /* 1.0V */
    buckCfg[2].dvsVout[2]   = 1000000U; /* 1.0V */
    buckCfg[2].dvsVout[3]   = 1000000U; /* 1.0V */
    buckCfg[2].dvsVout[4]   = 1000000U; /* 1.0V */
    buckCfg[2].dvsVout[5]   = 1000000U; /* 1.0V */
    buckCfg[2].dvsVout[6]   = 1000000U; /* 1.0V */
    buckCfg[2].dvsVout[7]   = 1000000U; /* 1.0V */
    buckCfg[2].stbyVout     = 1000000U; /* 1.0V */
#if defined(DEVICE_ID_PCA9422A)
    buckCfg[2].maxVout      = 1975000U; /* 1.975V */
#else
    buckCfg[2].maxVout      = 1200000U; /* 1.2V */
#endif
    buckCfg[2].sleepVout    = 400000U;  /* 0.4V */
}

void PCA9422_GetDefaultLDO234Config(pca9422_ldo234_config_t *ldoCfg)
{
    /* LDO2/3/4 default configuration */
    /* LDO2 default configuration */
    ldoCfg[0].cSel         = kPCA9422_LDO23AutoCoutDetection;
    ldoCfg[0].llSel        = kPCA9422_LDO23LLSel15mOhm;
    ldoCfg[0].lpMode       = kPCA9422_LDO23LPmodeNormal;
    ldoCfg[0].enMode       = kPCA9422_EnmodeOnAll;
    ldoCfg[0].ldoMode      = kPCA9422_LDO23LDOMode;
    ldoCfg[0].activeDischg = true;
    ldoCfg[0].vout         = 1800000U; /* 1.8V */
    ldoCfg[0].stbyVout     = 1800000U; /* 1.8V */
    ldoCfg[0].sleepVout    = 1800000U; /* 1.8V */

    /* LDO3 default configuration */
    ldoCfg[1].cSel         = kPCA9422_LDO23AutoCoutDetection;
    ldoCfg[1].llSel        = kPCA9422_LDO23LLSel15mOhm;
    ldoCfg[1].lpMode       = kPCA9422_LDO23LPmodeNormal;
    ldoCfg[1].enMode       = kPCA9422_EnmodeOnAll;
    ldoCfg[1].ldoMode      = kPCA9422_LDO23LDOMode;
    ldoCfg[1].activeDischg = true;
    ldoCfg[1].vout         = 1200000U; /* 1.2V */
    ldoCfg[1].stbyVout     = 1200000U; /* 1.2V */
    ldoCfg[1].sleepVout    = 1200000U; /* 1.2V */

    /* LDO4 default configuration */
    ldoCfg[2].activeDischg = true;
    ldoCfg[2].enMode       = kPCA9422_EnmodeOnAll;
    ldoCfg[2].vout         = 3300000U; /* 3.3V */
    ldoCfg[2].stbyVout     = 3300000U; /* 3.3V */
    ldoCfg[2].sleepVout    = 3000000U; /* 3.0V */
}

