solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
void PCA9422_GetDefaultLDO1Config(pca9422_ldo1_config_t *ldo1Cfg)
{
    /* LDO1 default configuration */
    ldo1Cfg->activeDischg = true;
    ldo1Cfg->enMode       = true;     /* Always ON */
    ldo1Cfg->vout         = 1800000U; /* 1.8V */
}

void PCA9422_GetDefaultBBConfig(pca9422_bb_config_t *bbCfg)
{
    bbCfg->fpwmEn     = kPCA9422_BBAutoPFMandPWM;
    bbCfg->ocCtrl     = kPCA9422_BBNotTurnOff;
    bbCfg->softStdn   = kPCA9422_BBRampDownDisabled;
    bbCfg->passiveDis = kPCA9422_BBPassiveDsgEnabled;
    bbCfg->enInRun    = kPCA9422_BBOnInRunState;
    bbCfg->bbMode     = kPCA9422_BBOPmodeAuto;
    bbCfg->enMode     = kPCA9422_BBEnmodeOnAll;
    bbCfg->lpMode     = kPCA9422_BBLPmodeNormal;

#if defined(DEVICE_ID_PCA9422A)
    bbCfg->vout      = 5000000U; /* 5.0V */
#else
    bbCfg->vout      = 1800000U; /* 1.8V */
#endif
    bbCfg->stdyVout  = 1800000U; /* 1.8V */
    bbCfg->maxVout   = 5000000U; /* 5.0V */
    bbCfg->minVout   = 1800000U; /* 1.8V */
    bbCfg->sleepVout = 1800000U; /* 1.8V */
}

void PCA9422_GetRegulatorDefaultConfig(pca9422_regulator_config_t *RegConfig)
{
    pca9422_buck_config_t buck[3];  /* buck1/2/3 */
    pca9422_ldo234_config_t ldo[3]; /* ldo2/3/4 */
    pca9422_ldo1_config_t ldo1;     /* ldo1 */
    pca9422_bb_config_t buckBoost;  /* buck-boost */

    /* Buck1/2/3 default configuration */
    PCA9422_GetDefaultBuckConfig(buck);

    /* LDO2/3/4 default configuration */
    PCA9422_GetDefaultLDO234Config(ldo);

    /* LDO1 default configuration */
    PCA9422_GetDefaultLDO1Config(&ldo1);

    /* Buck-Boost default configuration */
    PCA9422_GetDefaultBBConfig(&buckBoost);

    RegConfig->I2C_SendFunc    = NULL;
    RegConfig->I2C_ReceiveFunc = NULL;
    RegConfig->standbyCtrl     = kPCA9422_StandbyCtrlPins;
    RegConfig->standbyCfg      = kPCA9422_StandbyCfgStandby;
    RegConfig->dvsCtrl2En      = kPCA9422_DVSCtrl2PinIgnore;
    RegConfig->vsysUvlo        = kPCA9422_VsysUVLOSel2p7V;
    RegConfig->smartMode       = kPCA9422_SmartModeDisabled;
    RegConfig->buck[0]         = buck[0];
    RegConfig->buck[1]         = buck[1];
    RegConfig->buck[2]         = buck[2];
    RegConfig->ldo[0]          = ldo[0];
    RegConfig->ldo[1]          = ldo[1];
    RegConfig->ldo[2]          = ldo[2];
    RegConfig->ldo1            = ldo1;
    RegConfig->buckBoost       = buckBoost;
    RegConfig->slaveAddress    = PCA9422_DEFAULT_I2C_ADDR;
}

uint8_t PCA9422_GetDeviceID(pca9422_handle_t *handle)
{
    uint8_t regVal, regAddr, devID;
    bool result;

    /* Read Device ID */
    regAddr = PCA9422_DEV_INFO;
    result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        LOG_INFO("Error I2C data Read[0x%2X]\r\n", regAddr);
        devID = 0xFFU;
    }
    else
    {
        devID = (regVal & PCA9422_DEV_ID) >> 3U;
    }
    return devID;
}

void PCA9422_InitRegulator(pca9422_handle_t *handle, const pca9422_regulator_config_t *config)
{
    uint8_t regVal, regAddr;
    uint8_t bxDVS[8];
    bool result;
    uint32_t i;

    assert(handle);
    assert(config);

    /* Initialize Callback functions. */
    handle->I2C_SendFunc    = config->I2C_SendFunc;
    handle->I2C_ReceiveFunc = config->I2C_ReceiveFunc;
    /* Set Slave Address. */
    handle->slaveAddress = config->slaveAddress;

    /* INT1_MASK */
    regVal  = 0xFFU;
    regAddr = PCA9422_INT1_MASK;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* RESET_CTRL */
    regVal  = 0x00U;
    regAddr = PCA9422_RESET_CTRL;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* PWR_SEQ_CTRL */
    regVal  = 0x06U;
    regAddr = PCA9422_PWR_SEQ_CTRL;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SYS_CFG1 */
    regVal  = (uint8_t)config->standbyCtrl | (uint8_t)config->standbyCfg | (uint8_t)config->dvsCtrl2En;
    regAddr = PCA9422_SYS_CFG1;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SYS_CFG2 */
    regVal  = (uint8_t)kPCA9422_PowerSaveNormal | (uint8_t)kPCA9422_GPIOPullupLDO1 | (uint8_t)config->vsysUvlo;
    regAddr = PCA9422_SYS_CFG2;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK123_DVS_CFG1 */
    regVal =
        (uint8_t)((config->buck[0].dvsUpStep << 7U) | (config->buck[0].dvsDnStep << 6U) |
                  (config->buck[1].dvsUpStep << 5U) | (config->buck[1].dvsDnStep << 4U) | (uint8_t)(config->smartMode));
    regAddr = PCA9422_BUCK123_DVS_CFG1;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK123_DVS_CFG2 */
    regVal =
        (uint8_t)((config->buck[0].dvsCtrl << 6U) | (config->buck[1].dvsCtrl << 4U) | (config->buck[2].dvsCtrl << 2U) |
                  (config->buck[2].dvsUpStep << 1U) | (config->buck[2].dvsDnStep << 0U));
    regAddr = PCA9422_BUCK123_DVS_CFG2;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK1CTRL */
    regVal = (uint8_t)(config->buck[0].rampSpeed) | (uint8_t)(config->buck[0].lpMode) |
             (uint8_t)(config->buck[0].activeDischg) | (uint8_t)(config->buck[0].fpwmEn) |
             (uint8_t)(config->buck[0].enMode);
    regAddr = PCA9422_BUCK1CTRL;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK2CTRL */
    regVal = (uint8_t)(config->buck[1].rampSpeed) | (uint8_t)(config->buck[1].lpMode) |
             (uint8_t)(config->buck[1].activeDischg) | (uint8_t)(config->buck[1].fpwmEn) |
             (uint8_t)(config->buck[1].enMode);
    regAddr = PCA9422_BUCK2CTRL;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK3CTRL */
    regVal = (uint8_t)(config->buck[2].rampSpeed) | (uint8_t)(config->buck[2].lpMode) |
             (uint8_t)(config->buck[2].activeDischg) | (uint8_t)(uint8_t)(config->buck[2].fpwmEn) |
             (uint8_t)(config->buck[2].enMode);
    regAddr = PCA9422_BUCK3CTRL;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK1OUT_DVS */
    for (i = 0U; i < 8U; i++)
    {
        bxDVS[i] = (uint8_t)PCA9422_BUCK1_OUT_VAL(config->buck[0].dvsVout[i]);
    }
    regAddr = PCA9422_BUCK1OUT_DVS0;
    result  = PCA9422_WriteRegs(handle, regAddr, bxDVS, 8U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK2OUT_DVS */
    for (i = 0U; i < 8U; i++)
    {
        bxDVS[i] = (uint8_t)PCA9422_BUCK2_OUT_VAL(config->buck[1].dvsVout[i]);
    }
    regAddr = PCA9422_BUCK2OUT_DVS0;
    result  = PCA9422_WriteRegs(handle, regAddr, bxDVS, 8U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK3OUT_DVS */
    for (i = 0U; i < 8U; i++)
    {
        bxDVS[i] = (uint8_t)PCA9422_BUCK3_OUT_VAL(config->buck[2].dvsVout[i]);
    }
    regAddr = PCA9422_BUCK3OUT_DVS0;
    result  = PCA9422_WriteRegs(handle, regAddr, bxDVS, 8U);
    if (result == false)
    {
        goto out;
    }
    /* REG_LOCK - UNLOCK KEY */
    regVal  = (uint8_t)kPCA9422_RegLockUnlockKey;
    regAddr = PCA9422_REG_LOCK;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK1OUT_STBY */
    regVal  = (uint8_t)PCA9422_BUCK1_OUT_VAL(config->buck[0].stbyVout);
    regAddr = PCA9422_BUCK1OUT_STBY;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* PCA9422_BUCK1OUT_MAX_LIMIT */
    regVal  = (uint8_t)PCA9422_BUCK1_OUT_VAL(config->buck[0].maxVout);
    regAddr = PCA9422_BUCK1OUT_MAX_LIMIT;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK1OUT_SLEEP */
    regVal  = (uint8_t)PCA9422_BUCK1_OUT_VAL(config->buck[0].sleepVout);
    regAddr = PCA9422_BUCK1OUT_SLEEP;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK2OUT_STBY */
    regVal  = (uint8_t)PCA9422_BUCK2_OUT_VAL(config->buck[1].stbyVout);
    regAddr = PCA9422_BUCK2OUT_STBY;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK2OUT_MAX_LIMIT */
    regVal  = (uint8_t)PCA9422_BUCK2_OUT_VAL(config->buck[1].maxVout);
    regAddr = PCA9422_BUCK2OUT_MAX_LIMIT;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK2OUT_SLEEP */
    regVal  = (uint8_t)PCA9422_BUCK2_OUT_VAL(config->buck[1].sleepVout);
    regAddr = PCA9422_BUCK2OUT_SLEEP;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK3OUT_STBY */
    regVal  = (uint8_t)PCA9422_BUCK3_OUT_VAL(config->buck[2].stbyVout);
    regAddr = PCA9422_BUCK3OUT_STBY;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK3OUT_MAX_LIMIT */
    regVal  = (uint8_t)PCA9422_BUCK3_OUT_VAL(config->buck[2].maxVout);
    regAddr = PCA9422_BUCK3OUT_MAX_LIMIT;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* BUCK3OUT_SLEEP */
    regVal  = (uint8_t)PCA9422_BUCK3_OUT_VAL(config->buck[2].sleepVout);
    regAddr = PCA9422_BUCK3OUT_SLEEP;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO2_CFG */
    regVal = (uint8_t)config->ldo[0].cSel | (uint8_t)config->ldo[0].llSel | (uint8_t)config->ldo[0].lpMode |
             (uint8_t)config->ldo[0].enMode;
    regAddr = PCA9422_LDO2_CFG;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO2_OUT */
    regVal =((uint8_t)config->ldo[0].activeDischg << 7U) | (uint8_t)PCA9422_LDO23_OUT_VAL(config->ldo[0].vout);
    regAddr = PCA9422_LDO2_OUT;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO2_OUT_STBY */
    regVal  = (uint8_t)PCA9422_LDO23_OUT_VAL(config->ldo[0].stbyVout);
    regAddr = PCA9422_LDO2_OUT_STBY;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO2_OUT_SLEEP */
    regVal  = (uint8_t)PCA9422_LDO23_OUT_VAL(config->ldo[0].sleepVout);
    regAddr = PCA9422_LDO2_OUT_SLEEP;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO3_CFG */
    regVal = (uint8_t)config->ldo[1].cSel | (uint8_t)config->ldo[1].llSel | (uint8_t)config->ldo[1].lpMode |
             (uint8_t)config->ldo[1].enMode;
    regAddr = PCA9422_LDO3_CFG;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO3_OUT */
    regVal  = (uint8_t)(((uint32_t)config->ldo[1].activeDischg << 7UL) | PCA9422_LDO23_OUT_VAL(config->ldo[1].vout));
    regAddr = PCA9422_LDO3_OUT;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO3_OUT_STBY */
    regVal  = (uint8_t)PCA9422_LDO23_OUT_VAL(config->ldo[1].stbyVout);
    regAddr = PCA9422_LDO3_OUT_STBY;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO3_OUT_SLEEP */
    regVal  = (uint8_t)PCA9422_LDO23_OUT_VAL(config->ldo[1].sleepVout);
    regAddr = PCA9422_LDO3_OUT_SLEEP;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO23_CFG */
    regVal  = ((uint8_t)(config->ldo[0].ldoMode) << 6U) | ((uint8_t)(config->ldo[1].ldoMode) << 7U);
    regAddr = PCA9422_LDO23_CFG;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO4_CFG */
    regVal  = ((uint8_t)config->ldo[2].activeDischg << 4U) | ((uint8_t)(config->ldo[2].enMode));
    regAddr = PCA9422_LDO4_CFG;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO4_OUT */
    regVal  = (uint8_t)PCA9422_LDO4_OUT_VAL(config->ldo[2].vout);
    regAddr = PCA9422_LDO4_OUT;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO4_OUT_STBY */
    regVal  = (uint8_t)PCA9422_LDO4_OUT_VAL(config->ldo[2].stbyVout);
    regAddr = PCA9422_LDO4_OUT_STBY;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO4_OUT_SLEEP */
    regVal  = (uint8_t)PCA9422_LDO4_OUT_VAL(config->ldo[2].sleepVout);
    regAddr = PCA9422_LDO4_OUT_SLEEP;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO1_CFG1 */
    regVal  = (uint8_t)(((uint32_t)config->ldo1.activeDischg << 7UL) | PCA9422_LDO1_OUT_VAL(config->ldo1.vout));
    regAddr = PCA9422_LDO1_CFG1;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* LDO1_CFG2 */
    regVal  = (uint8_t)config->ldo1.enMode;
    regAddr = PCA9422_LDO1_CFG2;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SW4_BB_CFG1 */
    regVal = (uint8_t)config->buckBoost.fpwmEn | (uint8_t)config->buckBoost.ocCtrl |
             (uint8_t)config->buckBoost.softStdn | (uint8_t)config->buckBoost.passiveDis;
    regAddr = PCA9422_SW4_BB_CFG1;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SW4_BB_CFG2 */
    regVal = (uint8_t)config->buckBoost.enInRun | (uint8_t)config->buckBoost.bbMode |
             (uint8_t)config->buckBoost.enMode | (uint8_t)config->buckBoost.lpMode;
    regAddr = PCA9422_SW4_BB_CFG2;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SW4_BB_CFG3 - BB_VOUT */
    regVal  = (uint8_t)PCA9422_BB_OUT_VAL(config->buckBoost.vout);
    regAddr = PCA9422_SW4_BB_CFG3;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SW4_BB_CFG4 - BB_VOUT_STBY */
    regVal  = (uint8_t)PCA9422_BB_OUT_VAL(config->buckBoost.stdyVout);
    regAddr = PCA9422_SW4_BB_CFG4;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SW4_BB_MAX_LIMIT */
    regVal  = (uint8_t)PCA9422_BB_OUT_VAL(config->buckBoost.maxVout);
    regAddr = PCA9422_SW4_BB_MAX_LIMIT;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SW4_BB_MIN_LIMIT */
    regVal  = (uint8_t)PCA9422_BB_OUT_VAL(config->buckBoost.minVout);
    regAddr = PCA9422_SW4_BB_MIN_LIMIT;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* SW4_BB_VOUT_SLEEP */
    regVal  = (uint8_t)PCA9422_BB_OUT_VAL(config->buckBoost.sleepVout);
    regAddr = PCA9422_SW4_BB_VOUT_SLEEP;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    /* REG_LOCK - LOCK KEY */
    regVal  = (uint8_t)kPCA9422_RegLockLockKey;
    regAddr = PCA9422_REG_LOCK;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }
    return;

out:
    LOG_INFO("Error I2C data write[0x%2X]\r\n", regAddr);
    return;
}

void PCA9422_GetDefaultPowerModeConfig(pca9422_modecfg_t *config)
{
    /* SW1 output set to 1.0V. */
    config->sw1OutVolt = 1000000U;
#if defined(DEVICE_ID_PCA9422A)
    /* SW2 output set to 1.0V. */
    config->sw2OutVolt = 1000000U;
    /* SW3 output set to 1.8V. */
    config->sw3OutVolt = 1800000U;
    /* SW4 output set to 5.0V. */
    config->sw4OutVolt = 5000000U;
#else
    /* SW2 output set to 1.1V. */
    config->sw2OutVolt = 1100000U;
    /* SW3 output set to 1.0V. */
    config->sw3OutVolt = 1000000U;
    /* SW4 output set to 1.8V. */
    config->sw4OutVolt = 1800000U;
#endif
    /* LDO1 output set to 1.8V. */
    config->ldo1OutVolt = 1800000U;
    /* LDO2 output set to 1.8V. */
    config->ldo2OutVolt = 1800000U;
    /* LDO3 output set to 1.2V. */
    config->ldo3OutVolt = 1200000U;
    /* LDO4 output set to 3.3V. */
    config->ldo4OutVolt = 3300000U;
}

