solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
void PCA9422_GetDefaultEnModeConfig(pca9422_enmodecfg_t *enModeCfg)
{
    /* Enable mode is always ON in all regulators */
    enModeCfg->sw1OutEnMode  = kPCA9422_EnmodeOnAll;
    enModeCfg->sw2OutEnMode  = kPCA9422_EnmodeOnAll;
    enModeCfg->sw3OutEnMode  = kPCA9422_EnmodeOnAll;
    enModeCfg->sw4OutEnMode  = kPCA9422_EnmodeOnAll;
    enModeCfg->ldo1OutEnMode = kPCA9422_EnmodeOnAll;
    enModeCfg->ldo2OutEnMode = kPCA9422_EnmodeOnAll;
    enModeCfg->ldo3OutEnMode = kPCA9422_EnmodeOnAll;
    enModeCfg->ldo4OutEnMode = kPCA9422_EnmodeOnAll;
}

void PCA9422_GetDefaultRegEnableConfig(pca9422_regulatoren_t *regEnCfg)
{
    /* All regulators enable in RUN state. */
    regEnCfg->sw1Enable  = true;
    regEnCfg->sw2Enable  = true;
    regEnCfg->sw3Enable  = true;
    regEnCfg->sw4Enable  = true;
    regEnCfg->ldo1Enable = true;
    regEnCfg->ldo2Enable = true;
    regEnCfg->ldo3Enable = true;
    regEnCfg->ldo4Enable = true;
}

void PCA9422_GetLDO1EnMode(pca9422_handle_t *handle, bool *enmode)
{
    bool result;
    uint8_t regVal;

    result = PCA9422_ReadRegs(handle, PCA9422_LDO1_CFG2, &regVal, 1U);
    if (result == false)
    {
        LOG_INFO("Error I2C data Read[0x4A]\r\n");
    }
    else
    {
        *enmode = ((regVal & PCA9422_LDO1_CFG2_L1_ENMODE) != 0U) ? true : false;
    }
}

void PCA9422_SetLDO1EnMode(pca9422_handle_t *handle, bool enmode)
{
    bool result;

    result = PCA9422_ModifyReg(handle, PCA9422_LDO1_CFG2, PCA9422_LDO1_CFG2_L1_ENMODE, (uint8_t)enmode);
    if (result == false)
    {
        LOG_INFO("Error I2C data write[0x4A]\r\n");
    }
}

void PCA9422_GetRegulatorEnMode(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_enmode_t *enmode)
{
    uint8_t regVal, regAddr;
    bool result, ldo1EnMode = false;

    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            /* Read BUCK1CTRL */
            regAddr = PCA9422_BUCK1CTRL;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_BUCKXCTRL_BX_ENMODE;
            *enmode = (pca9422_enmode_t)regVal;
            break;
        case kPCA9422_RegulatorSwitch2:
            /* Read BUCK2CTRL */
            regAddr = PCA9422_BUCK2CTRL;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_BUCKXCTRL_BX_ENMODE;
            *enmode = (pca9422_enmode_t)regVal;
            break;
        case kPCA9422_RegulatorSwitch3:
            /* Read BUCK3CTRL */
            regAddr = PCA9422_BUCK3CTRL;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_BUCKXCTRL_BX_ENMODE;
            *enmode = (pca9422_enmode_t)regVal;
            break;
        case kPCA9422_RegulatorSwitch4:
            /* Read SW4_BB_CFG2 */
            regAddr = PCA9422_SW4_BB_CFG2;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = (regVal & PCA9422_SW4_BB_CFG2_BB_ENMODE) >> 2U;
            *enmode = (pca9422_enmode_t)(regVal);
            break;
        case kPCA9422_RegulatorLdo1:
            /* LDO1 ENMODE just has always on or off.
             * If it is always on mode, enmode will set kPCA9422_EnmodeOnAll
             * and if it is off, enmode will set kPCA9422_EnmodeOnActive */
            PCA9422_GetLDO1EnMode(handle, &ldo1EnMode);
            *enmode = ldo1EnMode ? kPCA9422_EnmodeOnAll : kPCA9422_EnmodeOnActive;
            break;
        case kPCA9422_RegulatorLdo2:
            /* Read LDO2_CFG */
            regAddr = PCA9422_LDO2_CFG;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_LDO2_CFG_L2_ENMODE;
            *enmode = (pca9422_enmode_t)regVal;
            break;
        case kPCA9422_RegulatorLdo3:
            /* Read LDO3_CFG */
            regAddr = PCA9422_LDO3_CFG;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_LDO3_CFG_L3_ENMODE;
            *enmode = (pca9422_enmode_t)regVal;
            break;
        case kPCA9422_RegulatorLdo4:
            /* Read LDO4_CFG */
            regAddr = PCA9422_LDO4_CFG;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_LDO4_CFG_L4_ENMODE;
            *enmode = (pca9422_enmode_t)regVal;
            break;
        default:
            LOG_INFO("Error Invalid regulator\r\n");
            *enmode = (pca9422_enmode_t)kPCA9422_EnmodeOnAll;
            break;
    }
    return;

out:
    LOG_INFO("Error I2C data read[0x%2X]\r\n", regAddr);
    return;
}

void PCA9422_SetRegulatorEnMode(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_enmode_t enmode)
{
    uint8_t regVal, regAddr, regMask;
    bool result, ldo1EnMode;

    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            /* Write BUCK1CTRL */
            regAddr = PCA9422_BUCK1CTRL;
            regVal  = (uint8_t)enmode;
            regMask = PCA9422_BUCKXCTRL_BX_ENMODE;
            break;
        case kPCA9422_RegulatorSwitch2:
            /* Write BUCK2CTRL */
            regAddr = PCA9422_BUCK2CTRL;
            regVal  = (uint8_t)enmode;
            regMask = PCA9422_BUCKXCTRL_BX_ENMODE;
            break;
        case kPCA9422_RegulatorSwitch3:
            /* Write BUCK3CTRL */
            regAddr = PCA9422_BUCK3CTRL;
            regVal  = (uint8_t)enmode;
            regMask = PCA9422_BUCKXCTRL_BX_ENMODE;
            break;
        case kPCA9422_RegulatorSwitch4:
            /* Write SW4_BB_CFG2 */
            regAddr = PCA9422_SW4_BB_CFG2;
            regVal  = (uint8_t)enmode << 2U;
            regMask = PCA9422_SW4_BB_CFG2_BB_ENMODE;
            break;
        case kPCA9422_RegulatorLdo1:
            /* Set LDO1 with PCA9422_SeLDO1EnMode function */
            ldo1EnMode = (enmode == kPCA9422_EnmodeOnAll) ? true : false;
            PCA9422_SetLDO1EnMode(handle, ldo1EnMode);
            regAddr = 0xFF;
            break;
        case kPCA9422_RegulatorLdo2:
            /* Write LDO2_CFG */
            regAddr = PCA9422_LDO2_CFG;
            regVal  = (uint8_t)enmode;
            regMask = PCA9422_LDO2_CFG_L2_ENMODE;
            break;
        case kPCA9422_RegulatorLdo3:
            /* Write LDO3_CFG */
            regAddr = PCA9422_LDO3_CFG;
            regVal  = (uint8_t)enmode;
            regMask = PCA9422_LDO3_CFG_L3_ENMODE;
            break;
        case kPCA9422_RegulatorLdo4:
            /* Write LDO4_CFG */
            regAddr = PCA9422_LDO4_CFG;
            regVal  = (uint8_t)enmode;
            regMask = PCA9422_LDO4_CFG_L4_ENMODE;
            break;
        default:
            LOG_INFO("Error Invalid regulator\r\n");
            regAddr = 0xFFU;
            break;
    }

    if (regAddr != 0xFFU)
    {
        result = PCA9422_ModifyReg(handle, regAddr, regMask, regVal);
        if (result == false)
        {
            LOG_INFO("Error I2C data write[0x%2X]\r\n", regAddr);
        }
    }
}

void PCA9422_GetRegulatorLPMode(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_reg_lpmode_t *lpmode)
{
    uint8_t regVal, regAddr;
    bool result;

    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            /* Read BUCK1CTRL */
            regAddr = PCA9422_BUCK1CTRL;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = (regVal & PCA9422_BUCKXCTRL_BX_LPMODE) >> 4U;
            *lpmode = (pca9422_reg_lpmode_t)regVal;
            break;
        case kPCA9422_RegulatorSwitch2:
            /* Read BUCK2CTRL */
            regAddr = PCA9422_BUCK2CTRL;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = (regVal & PCA9422_BUCKXCTRL_BX_LPMODE) >> 4U;
            *lpmode = (pca9422_reg_lpmode_t)regVal;
            break;
        case kPCA9422_RegulatorSwitch3:
            /* Read BUCK3CTRL */
            regAddr = PCA9422_BUCK3CTRL;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = (regVal & PCA9422_BUCKXCTRL_BX_LPMODE) >> 4U;
            *lpmode = (pca9422_reg_lpmode_t)regVal;
            break;
        case kPCA9422_RegulatorSwitch4:
            /* Read SW4_BB_CFG2 */
            regAddr = PCA9422_SW4_BB_CFG2;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_SW4_BB_CFG2_BB_LPMODE;
            *lpmode = (pca9422_reg_lpmode_t)regVal;
            break;
        case kPCA9422_RegulatorLdo1:
            /* There is no low power mode */
            *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeNormal;
            LOG_INFO("Error LDO1 doesn't support LP mode\r\n");
            break;
        case kPCA9422_RegulatorLdo2:
            /* Read LDO2_CFG */
            regAddr = PCA9422_LDO2_CFG;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_LDO2_CFG_L2_LPMODE;
            *lpmode = (pca9422_reg_lpmode_t)regVal;
            if (regVal == (uint8_t)kPCA9422_LDO23LPmodeAtRunState)
            {
                *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeForcedLPM;
            }
            else if (regVal == (uint8_t)kPCA9422_LDO23LPmodeAtStandbyDPStandby)
            {
                *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeAtStandbyDPStandby;
            }
            else if (regVal == (uint8_t)kPCA9422_LDO23LPmodeAtDPStandby)
            {
                *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPpmodeAtDPstandby;
            }
            else
            {
                *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeNormal;
            }
            break;
        case kPCA9422_RegulatorLdo3:
            /* Read LDO3_CFG */
            regAddr = PCA9422_LDO3_CFG;
            result  = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
            if (result == false)
            {
                goto out;
            }
            regVal  = regVal & PCA9422_LDO3_CFG_L3_LPMODE;
            *lpmode = (pca9422_reg_lpmode_t)regVal;
            if (regVal == (uint8_t)kPCA9422_LDO23LPmodeAtRunState)
            {
                *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeForcedLPM;
            }
            else if (regVal == (uint8_t)kPCA9422_LDO23LPmodeAtStandbyDPStandby)
            {
                *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeAtStandbyDPStandby;
            }
            else if (regVal == (uint8_t)kPCA9422_LDO23LPmodeAtDPStandby)
            {
                *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPpmodeAtDPstandby;
            }
            else
            {
                *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeNormal;
            }
            break;
        case kPCA9422_RegulatorLdo4:
            /* There is no low power mode */
            *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeNormal;
            LOG_INFO("Error LDO4 doesn't support LP mode\r\n");
            break;
        default:
            LOG_INFO("Error Invalid regulator\r\n");
            *lpmode = (pca9422_reg_lpmode_t)kPCA9422_LPmodeNormal;
            break;
    }
    return;

out:
    LOG_INFO("Error I2C data read[0x%2X]\r\n", regAddr);
    return;
}

