solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
void PCA9422_SetRegulatorLPMode(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_reg_lpmode_t lpmode)
{
    uint8_t regVal, regAddr, regMask;
    bool result;

    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            /* Write BUCK1CTRL */
            regAddr = PCA9422_BUCK1CTRL;
            regVal  = (uint8_t)lpmode << 4U;
            regMask = PCA9422_BUCKXCTRL_BX_LPMODE;
            break;
        case kPCA9422_RegulatorSwitch2:
            /* Write BUCK2CTRL */
            regAddr = PCA9422_BUCK2CTRL;
            regVal  = (uint8_t)lpmode << 4U;
            regMask = PCA9422_BUCKXCTRL_BX_LPMODE;
            break;
        case kPCA9422_RegulatorSwitch3:
            /* Write BUCK3CTRL */
            regAddr = PCA9422_BUCK3CTRL;
            regVal  = (uint8_t)lpmode << 4U;
            regMask = PCA9422_BUCKXCTRL_BX_LPMODE;
            break;
        case kPCA9422_RegulatorSwitch4:
            /* Write SW4_BB_CFG2 */
            regAddr = PCA9422_SW4_BB_CFG2;
            regVal  = (uint8_t)lpmode;
            regMask = PCA9422_SW4_BB_CFG2_BB_LPMODE;
            break;
        case kPCA9422_RegulatorLdo1:
            /* There is no low power mode */
            LOG_INFO("Error LDO1 doesn't support LP mode\r\n");
            regAddr = 0xFFU;
            break;
        case kPCA9422_RegulatorLdo2:
            /* Write LDO2_CFG */
            regAddr = PCA9422_LDO2_CFG;
            if (lpmode == kPCA9422_LPmodeForcedLPM)
            {
                regVal = (uint8_t)kPCA9422_LDO23LPmodeAtRunState;
            }
            else if (lpmode == kPCA9422_LPmodeAtStandbyDPStandby)
            {
                regVal = (uint8_t)kPCA9422_LDO23LPmodeAtStandbyDPStandby;
            }
            else if (lpmode == kPCA9422_LPpmodeAtDPstandby)
            {
                regVal = (uint8_t)kPCA9422_LDO23LPmodeAtDPStandby;
            }
            else
            {
                regVal = (uint8_t)kPCA9422_LDO23LPmodeNormal;
            }
            regMask = PCA9422_LDO2_CFG_L2_LPMODE;
            break;
        case kPCA9422_RegulatorLdo3:
            /* Write LDO3_CFG */
            regAddr = PCA9422_LDO3_CFG;
            if (lpmode == kPCA9422_LPmodeForcedLPM)
            {
                regVal = (uint8_t)kPCA9422_LDO23LPmodeAtRunState;
            }
            else if (lpmode == kPCA9422_LPmodeAtStandbyDPStandby)
            {
                regVal = (uint8_t)kPCA9422_LDO23LPmodeAtStandbyDPStandby;
            }
            else if (lpmode == kPCA9422_LPpmodeAtDPstandby)
            {
                regVal = (uint8_t)kPCA9422_LDO23LPmodeAtDPStandby;
            }
            else
            {
                regVal = (uint8_t)kPCA9422_LDO23LPmodeNormal;
            }
            regMask = PCA9422_LDO3_CFG_L3_LPMODE;
            break;
        case kPCA9422_RegulatorLdo4:
            /* There is no low power mode */
            LOG_INFO("Error LDO4 doesn't support LP mode\r\n");
            regAddr = 0xFFU;
            break;
        default:
            LOG_INFO("Error Invalid regulator\r\n");
            regAddr = 0xFFU;
            break;
    }

    if (regAddr != 0xFFU)
    {
        result = PCA9422_ModifyReg(handle, regAddr, regMask, regVal);
        if (result == false)
        {
            LOG_INFO("Error I2C data write[0x%2X]\r\n", regAddr);
        }
    }
    return;
}

void PCA9422_SetRegulatorVoltage(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_vout_t vout, uint32_t volt)
{
    uint8_t regVal, regAddr, regMask;
    bool result;

    /* REG_LOCK - UNLOCK KEY */
    regVal  = (uint8_t)kPCA9422_RegLockUnlockKey;
    regAddr = PCA9422_REG_LOCK;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }

    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            regVal  = (uint8_t)PCA9422_BUCK1_OUT_VAL(volt);
            regMask = PCA9422_BUCKXOUT_DVS0_BX_DVS0;
            /* Check VOUT type */
            switch (vout)
            {
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_BUCK1OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_BUCK1OUT_STBY;
                    break;
                case kPCA9422_SWMaxVout:
                    regAddr = PCA9422_BUCK1OUT_MAX_LIMIT;
                    break;
                case kPCA9422_SWDVS0Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS0;
                    break;
                case kPCA9422_SWDVS1Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS1;
                    break;
                case kPCA9422_SWDVS2Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS2;
                    break;
                case kPCA9422_SWDVS3Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS3;
                    break;
                case kPCA9422_SWDVS4Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS4;
                    break;
                case kPCA9422_SWDVS5Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS5;
                    break;
                case kPCA9422_SWDVS6Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS6;
                    break;
                case kPCA9422_SWDVS7Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS7;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - SW1 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            break;

        case kPCA9422_RegulatorSwitch2:
            regVal  = (uint8_t)PCA9422_BUCK2_OUT_VAL(volt);
            regMask = PCA9422_BUCKXOUT_DVS0_BX_DVS0;
            /* Check VOUT type */
            switch (vout)
            {
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_BUCK2OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_BUCK2OUT_STBY;
                    break;
                case kPCA9422_SWMaxVout:
                    regAddr = PCA9422_BUCK2OUT_MAX_LIMIT;
                    break;
                case kPCA9422_SWDVS0Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS0;
                    break;
                case kPCA9422_SWDVS1Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS1;
                    break;
                case kPCA9422_SWDVS2Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS2;
                    break;
                case kPCA9422_SWDVS3Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS3;
                    break;
                case kPCA9422_SWDVS4Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS4;
                    break;
                case kPCA9422_SWDVS5Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS5;
                    break;
                case kPCA9422_SWDVS6Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS6;
                    break;
                case kPCA9422_SWDVS7Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS7;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - SW2 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            break;

        case kPCA9422_RegulatorSwitch3:
            regVal  = (uint8_t)PCA9422_BUCK3_OUT_VAL(volt);
            regMask = PCA9422_BUCKXOUT_DVS0_BX_DVS0;
            /* Check VOUT type */
            switch (vout)
            {
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_BUCK3OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_BUCK3OUT_STBY;
                    break;
                case kPCA9422_SWMaxVout:
                    regAddr = PCA9422_BUCK3OUT_MAX_LIMIT;
                    break;
                case kPCA9422_SWDVS0Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS0;
                    break;
                case kPCA9422_SWDVS1Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS1;
                    break;
                case kPCA9422_SWDVS2Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS2;
                    break;
                case kPCA9422_SWDVS3Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS3;
                    break;
                case kPCA9422_SWDVS4Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS4;
                    break;
                case kPCA9422_SWDVS5Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS5;
                    break;
                case kPCA9422_SWDVS6Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS6;
                    break;
                case kPCA9422_SWDVS7Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS7;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - SW3 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            break;
        case kPCA9422_RegulatorSwitch4:
            regVal  = (uint8_t)PCA9422_BB_OUT_VAL(volt);
            regMask = (uint8_t)PCA9422_SW4_BB_CFG3_BB_VOUT;
            /* Check VOUT type */
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_SW4_BB_CFG3;
                    break;
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_SW4_BB_VOUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_SW4_BB_CFG4;
                    break;
                case kPCA9422_SWMaxVout:
                    regAddr = PCA9422_SW4_BB_MAX_LIMIT;
                    break;
                case kPCA9422_BBMinVout:
                    regAddr = PCA9422_SW4_BB_MIN_LIMIT;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - SW4 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            break;

        case kPCA9422_RegulatorLdo1:
            regVal  = (uint8_t)PCA9422_LDO1_OUT_VAL(volt);
            regMask = PCA9422_LDO1_CFG1_L1_OUT;
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_LDO1_CFG1;
                    break;
                case kPCA9422_RegSleepVout:
                case kPCA9422_RegStandbyVout:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("LDO1 doesn't support sleep/standby vout type(%d)\r\n", vout);
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - LDO1 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            break;

        case kPCA9422_RegulatorLdo2:
            regVal  = (uint8_t)PCA9422_LDO23_OUT_VAL(volt);
            regMask = PCA9422_LDO2_OUT_L2_OUT;
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_LDO2_OUT;
                    break;
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_LDO2_OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_LDO2_OUT_STBY;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - LDO2 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            break;

