solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
        case kPCA9422_RegulatorLdo3:
            regVal  = (uint8_t)PCA9422_LDO23_OUT_VAL(volt);
            regMask = PCA9422_LDO3_OUT_L3_OUT;
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_LDO3_OUT;
                    break;
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_LDO3_OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_LDO3_OUT_STBY;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - LDO3 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            break;
        case kPCA9422_RegulatorLdo4:
            regVal  = (uint8_t)PCA9422_LDO4_OUT_VAL(volt);
            regMask = PCA9422_LDO4_OUT_L4_OUT;
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_LDO4_OUT;
                    break;
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_LDO4_OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_LDO4_OUT_STBY;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - LDO4 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            break;
        default:
            regAddr = 0xFFU;
            LOG_INFO("Error Invalid regulator\r\n");
            break;
    }

    if (regAddr != 0xFFU)
    {
        result = PCA9422_ModifyReg(handle, regAddr, regMask, regVal);
        if (result == false)
        {
            goto out;
        }
        /* REG_LOCK - UNLOCK KEY */
        regVal  = (uint8_t)kPCA9422_RegLockUnlockKey;
        regAddr = PCA9422_REG_LOCK;
        result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
        if (result == false)
        {
            goto out;
        }
    }
    return;

out:
    LOG_INFO("Error I2C data write[0x%2X]\r\n", regAddr);
    return;
}

void PCA9422_GetRegulatorVoltage(pca9422_handle_t *handle, pca9422_regulator_t reg, pca9422_vout_t vout, uint32_t *volt)
{
    uint8_t regVal, regAddr, regMask = 0U;
    bool result = true;

    /* REG_LOCK - UNLOCK KEY */
    regVal  = (uint8_t)kPCA9422_RegLockUnlockKey;
    regAddr = PCA9422_REG_LOCK;
    result  = PCA9422_WriteRegs(handle, regAddr, &regVal, 1U);
    if (result == false)
    {
        goto out;
    }

    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            regMask = PCA9422_BUCKXOUT_DVS0_BX_DVS0;
            /* Check VOUT type */
            switch (vout)
            {
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_BUCK1OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_BUCK1OUT_STBY;
                    break;
                case kPCA9422_SWMaxVout:
                    regAddr = PCA9422_BUCK1OUT_MAX_LIMIT;
                    break;
                case kPCA9422_SWDVS0Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS0;
                    break;
                case kPCA9422_SWDVS1Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS1;
                    break;
                case kPCA9422_SWDVS2Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS2;
                    break;
                case kPCA9422_SWDVS3Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS3;
                    break;
                case kPCA9422_SWDVS4Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS4;
                    break;
                case kPCA9422_SWDVS5Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS5;
                    break;
                case kPCA9422_SWDVS6Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS6;
                    break;
                case kPCA9422_SWDVS7Vout:
                    regAddr = PCA9422_BUCK1OUT_DVS7;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - SW1 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            if (regAddr != 0xFFU)
            {
                result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
                if (result == false)
                    goto out;
                regVal = regVal & regMask;
                *volt  = PCA9422_BUCK1_OUT_VOLT(regVal);
            }
            else
            {
                *volt = 0U;
            }
            break;

        case kPCA9422_RegulatorSwitch2:
            regMask = PCA9422_BUCKXOUT_DVS0_BX_DVS0;
            /* Check VOUT type */
            switch (vout)
            {
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_BUCK2OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_BUCK2OUT_STBY;
                    break;
                case kPCA9422_SWMaxVout:
                    regAddr = PCA9422_BUCK2OUT_MAX_LIMIT;
                    break;
                case kPCA9422_SWDVS0Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS0;
                    break;
                case kPCA9422_SWDVS1Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS1;
                    break;
                case kPCA9422_SWDVS2Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS2;
                    break;
                case kPCA9422_SWDVS3Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS3;
                    break;
                case kPCA9422_SWDVS4Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS4;
                    break;
                case kPCA9422_SWDVS5Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS5;
                    break;
                case kPCA9422_SWDVS6Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS6;
                    break;
                case kPCA9422_SWDVS7Vout:
                    regAddr = PCA9422_BUCK2OUT_DVS7;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - SW2 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            if (regAddr != 0xFFU)
            {
                result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
                if (result == false)
                    goto out;
                regVal = regVal & regMask;
                *volt  = PCA9422_BUCK2_OUT_VOLT(regVal);
            }
            else
            {
                *volt = 0U;
            }
            break;

        case kPCA9422_RegulatorSwitch3:
            regMask = PCA9422_BUCKXOUT_DVS0_BX_DVS0;
            /* Check VOUT type */
            switch (vout)
            {
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_BUCK3OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_BUCK3OUT_STBY;
                    break;
                case kPCA9422_SWMaxVout:
                    regAddr = PCA9422_BUCK3OUT_MAX_LIMIT;
                    break;
                case kPCA9422_SWDVS0Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS0;
                    break;
                case kPCA9422_SWDVS1Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS1;
                    break;
                case kPCA9422_SWDVS2Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS2;
                    break;
                case kPCA9422_SWDVS3Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS3;
                    break;
                case kPCA9422_SWDVS4Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS4;
                    break;
                case kPCA9422_SWDVS5Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS5;
                    break;
                case kPCA9422_SWDVS6Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS6;
                    break;
                case kPCA9422_SWDVS7Vout:
                    regAddr = PCA9422_BUCK3OUT_DVS7;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - SW3 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            if (regAddr != 0xFFU)
            {
                result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
                if (result == false)
                    goto out;
                regVal = regVal & regMask;
                *volt  = PCA9422_BUCK3_OUT_VOLT(regVal);
            }
            else
            {
                *volt = 0U;
            }
            break;
        case kPCA9422_RegulatorSwitch4:
            regMask = (uint8_t)PCA9422_SW4_BB_CFG3_BB_VOUT;
            /* Check VOUT type */
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_SW4_BB_CFG3;
                    break;
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_SW4_BB_VOUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_SW4_BB_CFG4;
                    break;
                case kPCA9422_SWMaxVout:
                    regAddr = PCA9422_SW4_BB_MAX_LIMIT;
                    break;
                case kPCA9422_BBMinVout:
                    regAddr = PCA9422_SW4_BB_MIN_LIMIT;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - SW4 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            if (regAddr != 0xFFU)
            {
                result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
                if (result == false)
                {
                    goto out;
                }
                regVal = regVal & regMask;
                *volt  = PCA9422_BB_OUT_VOLT((uint32_t)regVal);
            }
            else
            {
                *volt = 0U;
            }
            break;

        case kPCA9422_RegulatorLdo1:
            /* Always ON LDO */
            regMask = PCA9422_LDO1_CFG1_L1_OUT;
            switch (vout)
            {
                case kPCA9422_RegVout ... kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_LDO1_CFG1;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - LDO1 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            if (regAddr != 0xFFU)
            {
                result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
                if (result == false)
                {
                    goto out;
                }
                regVal = regVal & regMask;
                *volt  = (uint32_t)PCA9422_LDO1_OUT_VOLT(regVal);
            }
            else
            {
                *volt = 0U;
            }
            break;

        case kPCA9422_RegulatorLdo2:
            regMask = PCA9422_LDO2_OUT_L2_OUT;
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_LDO2_OUT;
                    break;
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_LDO2_OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_LDO2_OUT_STBY;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - LDO2 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            if (regAddr != 0xFFU)
            {
                result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
                if (result == false)
                {
                    goto out;
                }
                regVal = regVal & regMask;
                *volt  = (uint32_t)PCA9422_LDO23_OUT_VOLT(regVal);
            }
            else
            {
                *volt = 0U;
            }
            break;

