solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
        case kPCA9422_RegulatorLdo3:
            regMask = PCA9422_LDO3_OUT_L3_OUT;
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_LDO3_OUT;
                    break;
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_LDO3_OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_LDO3_OUT_STBY;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - LDO3 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            if (regAddr != 0xFFU)
            {
                result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
                if (result == false)
                {
                    goto out;
                }
                regVal = regVal & regMask;
                *volt  = (uint32_t)PCA9422_LDO23_OUT_VOLT(regVal);
            }
            else
            {
                *volt = 0U;
            }
            break;
        case kPCA9422_RegulatorLdo4:
            regMask = PCA9422_LDO4_OUT_L4_OUT;
            switch (vout)
            {
                case kPCA9422_RegVout:
                    regAddr = PCA9422_LDO4_OUT;
                    break;
                case kPCA9422_RegSleepVout:
                    regAddr = PCA9422_LDO4_OUT_SLEEP;
                    break;
                case kPCA9422_RegStandbyVout:
                    regAddr = PCA9422_LDO4_OUT_STBY;
                    break;
                default:
                    /* Not support */
                    regAddr = 0xFFU;
                    LOG_INFO("Error - LDO4 doesn't support vout type(%d)\r\n", vout);
                    break;
            }
            if (regAddr != 0xFFU)
            {
                result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
                if (result == false)
                {
                    goto out;
                }
                regVal = regVal & regMask;
                *volt  = PCA9422_LDO4_OUT_VOLT(regVal);
            }
            else
            {
                *volt = 0U;
            }
            break;

        default:
            *volt = 0U;
            LOG_INFO("Error Invalid regulator\r\n");
            break;
    }
    return;

out:
    LOG_INFO("Error I2C data write[0x%2X]\r\n", regAddr);
    *volt = 0U;
    return;
}

uint8_t PCA9422_GetRegulatorStatus(pca9422_handle_t *handle)
{
    bool result    = true;
    uint8_t status = 0U;

    /* powerGoodEnable must be configured to true, otherwise the status is always 0. */
    result = PCA9422_ReadRegs(handle, PCA9422_REG_STATUS, &status, 1U);
    if (!result)
    {
        assert(false);
    }

    return status;
}

void PCA9422_SwitchPowerMode(pca9422_handle_t *handle, pca9422_power_mode_t mode)
{
    uint32_t pinMode;
    uint8_t regVal;
    bool result;

    switch (mode)
    {
        case kPCA9422_ActiveModeDVS0:
        case kPCA9422_ActiveModeDVS1:
        case kPCA9422_ActiveModeDVS2:
        case kPCA9422_ActiveModeDVS3:
        case kPCA9422_ActiveModeDVS4:
        case kPCA9422_ActiveModeDVS5:
        case kPCA9422_ActiveModeDVS6:
        case kPCA9422_ActiveModeDVS7:
            pinMode = 0x00U;
            break;
        case kPCA9422_StandbyMode:
            pinMode = 0x02U;
            break;
        case kPCA9422_DPStandbyMode:
            pinMode = 0x03U;
            break;
        case kPCA9422_SleepMode:
            pinMode = 0x01U;
            break;
        default:
            pinMode = 0x00U;
            break;
    }
    /* Switch by Pins */
    POWER_SetPmicMode((uint32_t)pinMode, kCfg_Run);

    /* Read SYS_CFG1 */
    result = PCA9422_ReadRegs(handle, PCA9422_SYS_CFG1, &regVal, 1U);
    if (result == false)
    {
        LOG_INFO("Error I2C data Read[0x%2X]\r\n", PCA9422_SYS_CFG1);
    }

    if ((regVal & PCA9422_SYS_CFG1_STANDBY_CTRL) != 0U)
    {
        /* Standby/DPStandby mode controlled by STANDBY_CFG bit */
        if (mode == kPCA9422_StandbyMode)
        {
            regVal = (uint8_t)kPCA9422_StandbyCfgStandby;
            result = PCA9422_ModifyReg(handle, PCA9422_SYS_CFG1, PCA9422_SYS_CFG1_STANDBY_CFG, regVal);
        }
        else if (mode == kPCA9422_DPStandbyMode)
        {
            regVal = (uint8_t)kPCA9422_StandbyCfgDPStandby;
            result = PCA9422_ModifyReg(handle, PCA9422_SYS_CFG1, PCA9422_SYS_CFG1_STANDBY_CFG, regVal);
        }
        else
        {
            /* Intentional empty. */
        }

        if (!result)
        {
            LOG_INFO("Error I2C operation [0x%2X]\r\n", PCA9422_SYS_CFG1);
        }
    }
}

bool PCA9422_GetCurrentPowerMode(pca9422_handle_t *handle, pca9422_power_mode_t *mode)
{
    bool result    = true;
    uint8_t regVal = 0U;

    /* Read PWR_STATE */
    result = PCA9422_ReadRegs(handle, PCA9422_PWR_STATE, &regVal, 1U);
    regVal = regVal & PCA9422_PWR_STATE_PWR_MODE;
    *mode  = (pca9422_power_mode_t)regVal;

    return result;
}

void PCA9422_GetCurrentEnMode(pca9422_handle_t *handle, pca9422_enmodecfg_t *config)
{
    PCA9422_GetRegulatorEnMode(handle, kPCA9422_RegulatorSwitch1, &config->sw1OutEnMode);
    PCA9422_GetRegulatorEnMode(handle, kPCA9422_RegulatorSwitch2, &config->sw2OutEnMode);
    PCA9422_GetRegulatorEnMode(handle, kPCA9422_RegulatorSwitch3, &config->sw3OutEnMode);
    PCA9422_GetRegulatorEnMode(handle, kPCA9422_RegulatorSwitch4, &config->sw4OutEnMode);
    PCA9422_GetRegulatorEnMode(handle, kPCA9422_RegulatorLdo1, &config->ldo1OutEnMode);
    PCA9422_GetRegulatorEnMode(handle, kPCA9422_RegulatorLdo2, &config->ldo2OutEnMode);
    PCA9422_GetRegulatorEnMode(handle, kPCA9422_RegulatorLdo3, &config->ldo3OutEnMode);
    PCA9422_GetRegulatorEnMode(handle, kPCA9422_RegulatorLdo4, &config->ldo4OutEnMode);
}

bool PCA9422_GetStandbyControl(pca9422_handle_t *handle, pca9422_standby_ctrl_t *ctrl)
{
    bool result    = true;
    uint8_t regVal = 0U;

    /* Read SYS_CFG1 */
    result = PCA9422_ReadRegs(handle, PCA9422_SYS_CFG1, &regVal, 1U);
    regVal = regVal & PCA9422_SYS_CFG1_STANDBY_CTRL;
    *ctrl  = (pca9422_standby_ctrl_t)regVal;

    return result;
}

void PCA9422_SetBuckDVSControl(pca9422_handle_t *handle, pca9422_regulator_t reg, uint8_t dvsCtrl)
{
    uint8_t regVal, regAddr, regMask;
    bool result;

    regAddr = PCA9422_BUCK123_DVS_CFG2;
    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            regMask = PCA9422_BUCK123_DVS_CFG2_B1_DVS_CTRL;
            regVal  = (uint8_t)(dvsCtrl << MASK2SHIFT(PCA9422_BUCK123_DVS_CFG2_B1_DVS_CTRL));
            break;
        case kPCA9422_RegulatorSwitch2:
            regMask = PCA9422_BUCK123_DVS_CFG2_B2_DVS_CTRL;
            regVal  = (uint8_t)(dvsCtrl << MASK2SHIFT(PCA9422_BUCK123_DVS_CFG2_B2_DVS_CTRL));
            break;
        case kPCA9422_RegulatorSwitch3:
            regMask = PCA9422_BUCK123_DVS_CFG2_B3_DVS_CTRL;
            regVal  = (uint8_t)(dvsCtrl << MASK2SHIFT(PCA9422_BUCK123_DVS_CFG2_B3_DVS_CTRL));
            break;
        default:
            LOG_INFO("Error Invalid regulator\r\n");
            regAddr = 0xFFU;
            break;
    }

    if (regAddr != 0xFFU)
    {
        result = PCA9422_ModifyReg(handle, regAddr, regMask, regVal);
        if (result == false)
        {
            LOG_INFO("Error I2C data write[0x%2X]\r\n", regAddr);
        }
    }
    return;
}

void PCA9422_SetEnableRegulatorRunState(pca9422_handle_t *handle, pca9422_regulator_t reg, bool enable)
{
    uint8_t regVal, regAddr, regMask;
    bool result;

    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            regAddr = PCA9422_REGULATOR_EN;
            regVal  = (enable == true) ? PCA9422_REGULATOR_EN_B1_ENABLE : 0U;
            regMask = PCA9422_REGULATOR_EN_B1_ENABLE;
            break;
        case kPCA9422_RegulatorSwitch2:
            regAddr = PCA9422_REGULATOR_EN;
            regVal  = (enable == true) ? PCA9422_REGULATOR_EN_B2_ENABLE : 0U;
            regMask = PCA9422_REGULATOR_EN_B2_ENABLE;
            break;
        case kPCA9422_RegulatorSwitch3:
            regAddr = PCA9422_REGULATOR_EN;
            regVal  = (enable == true) ? PCA9422_REGULATOR_EN_B3_ENABLE : 0U;
            regMask = PCA9422_REGULATOR_EN_B3_ENABLE;
            break;
        case kPCA9422_RegulatorSwitch4:
            regAddr = PCA9422_SW4_BB_CFG2;
            regVal  = (enable == true) ? PCA9422_SW4_BB_CFG2_BB_ENABLE : 0U;
            regMask = PCA9422_SW4_BB_CFG2_BB_ENABLE;
            break;
        case kPCA9422_RegulatorLdo1:
            LOG_INFO("LDO1-Always ON LDO in Run state\r\n");
            regAddr = 0xFFU;
            break;
        case kPCA9422_RegulatorLdo2:
            regAddr = PCA9422_REGULATOR_EN;
            regVal  = (enable == true) ? PCA9422_REGULATOR_EN_L2_ENABLE : 0U;
            regMask = PCA9422_REGULATOR_EN_L2_ENABLE;
            break;
        case kPCA9422_RegulatorLdo3:
            regAddr = PCA9422_REGULATOR_EN;
            regVal  = (enable == true) ? PCA9422_REGULATOR_EN_L3_ENABLE : 0U;
            regMask = PCA9422_REGULATOR_EN_L3_ENABLE;
            break;
        case kPCA9422_RegulatorLdo4:
            regAddr = PCA9422_REGULATOR_EN;
            regVal  = (enable == true) ? PCA9422_REGULATOR_EN_L4_ENABLE : 0U;
            regMask = PCA9422_REGULATOR_EN_L4_ENABLE;
            break;
        default:
            LOG_INFO("Error Invalid regulator\r\n");
            regAddr = 0xFFU;
            break;
    }

    if (regAddr != 0xFFU)
    {
        result = PCA9422_ModifyReg(handle, regAddr, regMask, regVal);
        if (result == false)
        {
            LOG_INFO("Error I2C data write[0x%2X]\r\n", regAddr);
        }
    }
    return;
}

void PCA9422_GetEnableRegulatorRunState(pca9422_handle_t *handle, pca9422_regulator_t reg, bool *enable)
{
    uint8_t regVal, regAddr, regMask;
    bool result;

    switch (reg)
    {
        case kPCA9422_RegulatorSwitch1:
            regAddr = PCA9422_REGULATOR_EN;
            regMask = PCA9422_REGULATOR_EN_B1_ENABLE;
            break;
        case kPCA9422_RegulatorSwitch2:
            regAddr = PCA9422_REGULATOR_EN;
            regMask = PCA9422_REGULATOR_EN_B2_ENABLE;
            break;
        case kPCA9422_RegulatorSwitch3:
            regAddr = PCA9422_REGULATOR_EN;
            regMask = PCA9422_REGULATOR_EN_B3_ENABLE;
            break;
        case kPCA9422_RegulatorSwitch4:
            regAddr = PCA9422_SW4_BB_CFG2;
            regMask = PCA9422_SW4_BB_CFG2_BB_ENABLE;
            break;
        case kPCA9422_RegulatorLdo1:
            /* Always ON LDO in Run state */
            regAddr = 0xFFU;
            break;
        case kPCA9422_RegulatorLdo2:
            regAddr = PCA9422_REGULATOR_EN;
            regMask = PCA9422_REGULATOR_EN_L2_ENABLE;
            break;
        case kPCA9422_RegulatorLdo3:
            regAddr = PCA9422_REGULATOR_EN;
            regMask = PCA9422_REGULATOR_EN_L3_ENABLE;
            break;
        case kPCA9422_RegulatorLdo4:
            regAddr = PCA9422_REGULATOR_EN;
            regMask = PCA9422_REGULATOR_EN_L4_ENABLE;
            break;
        default:
            LOG_INFO("Error Invalid regulator\r\n");
            regAddr = 0xFFU;
            break;
    }

    if (regAddr != 0xFFU)
    {
        result = PCA9422_ReadRegs(handle, regAddr, &regVal, 1U);
        if (result == false)
        {
            LOG_INFO("Error I2C data read[0x%2X]\r\n", regAddr);
            *enable = false;
        }
        else
        {
            regVal  = (regVal & regMask);
            *enable = (regVal == regMask) ? true : false;
        }
    }
    else
    {
        if (reg == kPCA9422_RegulatorLdo1)
        {
            *enable = true;
        }
        else
        {
            *enable = false;
        }
    }

    return;
}

void PCA9422_ReadPowerModeConfigs(pca9422_handle_t *handle, pca9422_power_mode_t powerMode, pca9422_modecfg_t *configs)
{
    switch (powerMode)
    {
        case kPCA9422_ActiveModeDVS0:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_SWDVS0Vout, &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_SWDVS0Vout, &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_SWDVS0Vout, &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegVout, &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegVout, &configs->ldo4OutVolt);
            break;
        case kPCA9422_ActiveModeDVS1:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_SWDVS1Vout, &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_SWDVS1Vout, &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_SWDVS1Vout, &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegVout, &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegVout, &configs->ldo4OutVolt);
            break;
        case kPCA9422_ActiveModeDVS2:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_SWDVS2Vout, &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_SWDVS2Vout, &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_SWDVS2Vout, &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegVout, &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegVout, &configs->ldo4OutVolt);
            break;
        case kPCA9422_ActiveModeDVS3:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_SWDVS3Vout, &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_SWDVS3Vout, &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_SWDVS3Vout, &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegVout, &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegVout, &configs->ldo4OutVolt);
            break;
        case kPCA9422_ActiveModeDVS4:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_SWDVS4Vout, &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_SWDVS4Vout, &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_SWDVS4Vout, &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegVout, &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegVout, &configs->ldo4OutVolt);
            break;
        case kPCA9422_ActiveModeDVS5:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_SWDVS5Vout, &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_SWDVS5Vout, &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_SWDVS5Vout, &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegVout, &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegVout, &configs->ldo4OutVolt);
            break;
        case kPCA9422_ActiveModeDVS6:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_SWDVS6Vout, &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_SWDVS6Vout, &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_SWDVS6Vout, &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegVout, &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegVout, &configs->ldo4OutVolt);
            break;
        case kPCA9422_ActiveModeDVS7:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_SWDVS7Vout, &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_SWDVS7Vout, &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_SWDVS7Vout, &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegVout, &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegVout, &configs->ldo4OutVolt);
            break;

        case kPCA9422_StandbyMode:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_RegStandbyVout,
                                        &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_RegStandbyVout,
                                        &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_RegStandbyVout,
                                        &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegStandbyVout,
                                        &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegStandbyVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegStandbyVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegStandbyVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegStandbyVout, &configs->ldo4OutVolt);
            break;

        case kPCA9422_DPStandbyMode:
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_RegStandbyVout,
                                        &configs->sw1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_RegStandbyVout,
                                        &configs->sw2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_RegStandbyVout,
                                        &configs->sw3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegStandbyVout,
                                        &configs->sw4OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegStandbyVout, &configs->ldo1OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegStandbyVout, &configs->ldo2OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegStandbyVout, &configs->ldo3OutVolt);
            PCA9422_GetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegStandbyVout, &configs->ldo4OutVolt);
            break;

