solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
        case kPCA9422_SleepMode:
            PCA9422_SetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch1, kPCA9422_RegSleepVout, configs.sw1OutVolt);
            PCA9422_SetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch2, kPCA9422_RegSleepVout, configs.sw2OutVolt);
            PCA9422_SetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch3, kPCA9422_RegSleepVout, configs.sw3OutVolt);
            PCA9422_SetRegulatorVoltage(handle, kPCA9422_RegulatorSwitch4, kPCA9422_RegSleepVout, configs.sw4OutVolt);
            PCA9422_SetRegulatorVoltage(handle, kPCA9422_RegulatorLdo1, kPCA9422_RegSleepVout, configs.ldo1OutVolt);
            PCA9422_SetRegulatorVoltage(handle, kPCA9422_RegulatorLdo2, kPCA9422_RegSleepVout, configs.ldo2OutVolt);
            PCA9422_SetRegulatorVoltage(handle, kPCA9422_RegulatorLdo3, kPCA9422_RegSleepVout, configs.ldo3OutVolt);
            PCA9422_SetRegulatorVoltage(handle, kPCA9422_RegulatorLdo4, kPCA9422_RegSleepVout, configs.ldo4OutVolt);
            break;

        case kPCA9422_NoneMode:
            /* Skip this mode */
            LOG_INFO("Skip power mode(%d)\r\n", powerMode);
            break;

        default:
            LOG_INFO("Error - Don't support power mode(%d)\r\n", powerMode);
            break;
    }
}
/* @} */

void PCA9422_WriteEnModeConfig(pca9422_handle_t *handle, pca9422_enmodecfg_t config)
{
    /* Set Enmode */
    PCA9422_SetRegulatorEnMode(handle, kPCA9422_RegulatorSwitch1, config.sw1OutEnMode);
    PCA9422_SetRegulatorEnMode(handle, kPCA9422_RegulatorSwitch2, config.sw2OutEnMode);
    PCA9422_SetRegulatorEnMode(handle, kPCA9422_RegulatorSwitch3, config.sw3OutEnMode);
    PCA9422_SetRegulatorEnMode(handle, kPCA9422_RegulatorSwitch4, config.sw4OutEnMode);
    PCA9422_SetRegulatorEnMode(handle, kPCA9422_RegulatorLdo1, config.ldo1OutEnMode);
    PCA9422_SetRegulatorEnMode(handle, kPCA9422_RegulatorLdo2, config.ldo2OutEnMode);
    PCA9422_SetRegulatorEnMode(handle, kPCA9422_RegulatorLdo3, config.ldo3OutEnMode);
    PCA9422_SetRegulatorEnMode(handle, kPCA9422_RegulatorLdo4, config.ldo4OutEnMode);
}

void PCA9422_WriteRegEnableConfig(pca9422_handle_t *handle, pca9422_regulatoren_t config)
{
    /* Set Enable */
    PCA9422_SetEnableRegulatorRunState(handle, kPCA9422_RegulatorSwitch1, config.sw1Enable);
    PCA9422_SetEnableRegulatorRunState(handle, kPCA9422_RegulatorSwitch2, config.sw2Enable);
    PCA9422_SetEnableRegulatorRunState(handle, kPCA9422_RegulatorSwitch3, config.sw3Enable);
    PCA9422_SetEnableRegulatorRunState(handle, kPCA9422_RegulatorSwitch4, config.sw4Enable);
    PCA9422_SetEnableRegulatorRunState(handle, kPCA9422_RegulatorLdo1, config.ldo1Enable);
    PCA9422_SetEnableRegulatorRunState(handle, kPCA9422_RegulatorLdo2, config.ldo2Enable);
    PCA9422_SetEnableRegulatorRunState(handle, kPCA9422_RegulatorLdo3, config.ldo3Enable);
    PCA9422_SetEnableRegulatorRunState(handle, kPCA9422_RegulatorLdo4, config.ldo4Enable);
}

static bool PCA9422_EnableState(pca9422_power_mode_t powerMode, pca9422_enmode_t enmode)
{
    bool enable;

    switch (powerMode)
    {
        case kPCA9422_ActiveModeDVS0 ... kPCA9422_ActiveModeDVS7:
            enable = true;
            break;
        case kPCA9422_StandbyMode:
            enable = (enmode < kPCA9422_EnmodeOnActiveSleep) ? true : false;
            break;
        case kPCA9422_DPStandbyMode:
            enable = (enmode < kPCA9422_EnmodeOnActiveSleepStandby) ? true : false;
            break;
        case kPCA9422_SleepMode:
            enable = (enmode < kPCA9422_EnmodeOnActive) ? true : false;
            break;
        default:
            enable = false;
            break;
    }
    return enable;
}

void PCA9422_ReadEnableConfigs(pca9422_handle_t *handle, pca9422_power_mode_t powerMode, pca9422_enablecfg_t *config)
{
    pca9422_enmodecfg_t enmodeCfg;
    pca9422_regulatoren_t regenable;

    /* Read Enmode */
    PCA9422_GetCurrentEnMode(handle, &enmodeCfg);
    /* Read Regulator Enable */
    PCA9422_GetEnableRegulatorRunState(handle, kPCA9422_RegulatorSwitch1, &regenable.sw1Enable);
    PCA9422_GetEnableRegulatorRunState(handle, kPCA9422_RegulatorSwitch2, &regenable.sw2Enable);
    PCA9422_GetEnableRegulatorRunState(handle, kPCA9422_RegulatorSwitch3, &regenable.sw3Enable);
    PCA9422_GetEnableRegulatorRunState(handle, kPCA9422_RegulatorSwitch4, &regenable.sw4Enable);
    PCA9422_GetEnableRegulatorRunState(handle, kPCA9422_RegulatorLdo1, &regenable.ldo1Enable);
    PCA9422_GetEnableRegulatorRunState(handle, kPCA9422_RegulatorLdo2, &regenable.ldo2Enable);
    PCA9422_GetEnableRegulatorRunState(handle, kPCA9422_RegulatorLdo3, &regenable.ldo3Enable);
    PCA9422_GetEnableRegulatorRunState(handle, kPCA9422_RegulatorLdo4, &regenable.ldo4Enable);

    /* Check power mode */
    switch (powerMode)
    {
        case kPCA9422_ActiveModeDVS0 ... kPCA9422_ActiveModeDVS7:
            config->enableSw1Out  = regenable.sw1Enable ? true : false;
            config->enableSw2Out  = regenable.sw2Enable ? true : false;
            config->enableSw3Out  = regenable.sw3Enable ? true : false;
            config->enableSw4Out  = regenable.sw4Enable ? true : false;
            config->enableLdo1Out = regenable.ldo1Enable ? true : false;
            config->enableLdo2Out = regenable.ldo2Enable ? true : false;
            config->enableLdo3Out = regenable.ldo3Enable ? true : false;
            config->enableLdo4Out = regenable.ldo4Enable ? true : false;
            break;
        case kPCA9422_StandbyMode:
        case kPCA9422_DPStandbyMode:
        case kPCA9422_SleepMode:
            config->enableSw1Out = regenable.sw1Enable ? PCA9422_EnableState(powerMode, enmodeCfg.sw1OutEnMode) : false;
            config->enableSw2Out = regenable.sw2Enable ? PCA9422_EnableState(powerMode, enmodeCfg.sw2OutEnMode) : false;
            config->enableSw3Out = regenable.sw3Enable ? PCA9422_EnableState(powerMode, enmodeCfg.sw3OutEnMode) : false;
            config->enableSw4Out = regenable.sw4Enable ? PCA9422_EnableState(powerMode, enmodeCfg.sw4OutEnMode) : false;
            config->enableLdo1Out =
                regenable.ldo1Enable ? PCA9422_EnableState(powerMode, enmodeCfg.ldo1OutEnMode) : false;
            config->enableLdo2Out =
                regenable.ldo2Enable ? PCA9422_EnableState(powerMode, enmodeCfg.ldo2OutEnMode) : false;
            config->enableLdo3Out =
                regenable.ldo3Enable ? PCA9422_EnableState(powerMode, enmodeCfg.ldo3OutEnMode) : false;
            config->enableLdo4Out =
                regenable.ldo4Enable ? PCA9422_EnableState(powerMode, enmodeCfg.ldo4OutEnMode) : false;
            break;
        default:
            /* Not supported. */
            break;
    }
}

void PCA9422_FeedWatchDog(pca9422_handle_t *handle)
{
    uint8_t regValue = 1U;

    (void)PCA9422_WriteRegs(handle, PCA9422_TOP_CNTL4, &regValue, 1U);
}

void PCA9422_SetWatchDogTimer(pca9422_handle_t *handle, pca9422_wd_timer_t wd_timer)
{
    bool result;

    result = PCA9422_ModifyReg(handle, PCA9422_TOP_CNTL0, PCA9422_TOP_CNTL0_WD_TIMER, (uint8_t)wd_timer);
    if (result == false)
    {
        LOG_INFO("Error I2C data write[0x%x]\r\n", PCA9422_TOP_CNTL0);
    }
}

