solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pca9422/fsl_pca9422.c
bool PCA9422_WriteRegsReadback(pca9422_handle_t *handle, uint8_t regBase, uint8_t *val)
{
    bool result;
    uint8_t regData;

    result = PCA9422_WriteRegs(handle, regBase, val, 1U);
    if (result == true)
    {
        /* Read back */
        result = PCA9422_ReadRegs(handle, regBase, &regData, 1U);
        if (result == true)
        {
            /* Compare data */
            if (regData != *val)
            {
                LOG_INFO("Error I2C data[0x%x] written(0x%x) vs read(0x%x)\r\n", regBase, *val, regData);
                result = false;
            }
        }
        else
        {
            LOG_INFO("Error I2C data read[0x%x]\r\n", regBase);
        }
    }
    else
    {
        LOG_INFO("Error I2C data write[0x%x]\r\n", regBase);
    }
    return result;
}

bool PCA9422_ModifyRegReadback(pca9422_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val)
{
    bool result;
    uint8_t regValue = 0U;

    assert(handle);

    /* Read back the register content. */
    result = PCA9422_ReadRegs(handle, reg, &regValue, 1U);
    if (result)
    {
        /* Modify the bit-fields you want to change. */
        regValue &= (uint8_t)~mask;
        regValue |= val;

        /* Write back the content to the registers. */
        result = PCA9422_WriteRegsReadback(handle, reg, &regValue);
    }

    return result;
}

bool PCA9422_WriteRegs(pca9422_handle_t *handle, uint8_t regBase, uint8_t *val, uint32_t size)
{
    assert(handle);
    assert(handle->I2C_SendFunc);
    assert(val);

    return (kStatus_Success == handle->I2C_SendFunc(handle->slaveAddress, regBase, 1U, val, size)) ? true : false;
}

bool PCA9422_ReadRegs(pca9422_handle_t *handle, uint8_t regBase, uint8_t *val, uint32_t size)
{
    assert(handle);
    assert(handle->I2C_ReceiveFunc);
    assert(val);

    return (kStatus_Success == handle->I2C_ReceiveFunc(handle->slaveAddress, regBase, 1U, val, size)) ? true : false;
}

bool PCA9422_ModifyReg(pca9422_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val)
{
    bool result;
    uint8_t regValue = 0U;

    assert(handle);

    /* Read back the register content. */
    result = PCA9422_ReadRegs(handle, reg, &regValue, 1U);
    if (result)
    {
        /* Modify the bit-fields you want to change. */
        regValue &= (uint8_t)~mask;
        regValue |= val;

        /* Write back the content to the registers. */
        result = PCA9422_WriteRegs(handle, reg, &regValue, 1U);
    }

    return result;
}

void PCA9422_EnableChargerInterrupts(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;
    uint8_t maskVal[6];

    maskVal[0] = (uint8_t)(~(source[0] & 0xFFU)); /* INT_DEVICE_0_MASK */
    maskVal[1] = (uint8_t)(~(source[1] & 0xFFU)); /* INT_DEVICE_1_MASK */
    maskVal[2] = (uint8_t)(~(source[2] & 0xFFU)); /* INT_CHARGE_0_MASK */
    maskVal[3] = (uint8_t)(~(source[3] & 0xFFU)); /* INT_CHARGE_1_MASK */
    maskVal[4] = (uint8_t)(~(source[4] & 0xFFU)); /* INT_CHARGE_2_MASK */
    maskVal[5] = (uint8_t)(~(source[5] & 0xFFU)); /* INT_CHARGE_3_MASK */

    /* Write mask registers */
    result = PCA9422_WriteRegs(handle, PCA9422_INT_DEVICE_0_MASK, maskVal, sizeof(maskVal));
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask registers of charge\r\n");
    }
}

void PCA9422_DisableChargerInterrupts(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;
    uint8_t maskVal[6] = {
        0,
    };

    (void)memcpy(source, maskVal, sizeof(maskVal));

    /* Write mask registers */
    result = PCA9422_WriteRegs(handle, PCA9422_INT_DEVICE_0_MASK, maskVal, sizeof(maskVal));
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask registers of charge\r\n");
    }
}

void PCA9422_GetChargerInterrupts(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;

    /* Read interrupt registers */
    result = PCA9422_ReadRegs(handle, PCA9422_INT_DEVICE_0, source, 6U);
    if (!result)
    {
        LOG_INFO("Error I2C data read interrupt registers of charge\r\n");
    }
}

void PCA9422_GetChargerInterruptStatus(pca9422_handle_t *handle, uint8_t *status)
{
    bool result;

    /* Read interrupt status registers */
    result = PCA9422_ReadRegs(handle, PCA9422_DEVICE_0_STS, status, 6U);
    if (!result)
    {
        LOG_INFO("Error I2C data read interrupt status registers of charge\r\n");
    }
}

void PCA9422_EnableRegulatorInterrupt(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;
    uint8_t maskVal;

    maskVal = (uint8_t)(~(*source & 0xFFU)); /* INT1_MASK */
    /* Write mask register */
    result = PCA9422_WriteRegs(handle, PCA9422_INT1_MASK, &maskVal, sizeof(maskVal));
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask register of regulator\r\n");
    }
}

void PCA9422_DisableRegulatorInterrupt(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;
    uint8_t maskVal = {
        0,
    };

    (void)memcpy(source, &maskVal, sizeof(maskVal));
    /* Write mask register */
    result = PCA9422_WriteRegs(handle, PCA9422_INT1_MASK, &maskVal, sizeof(maskVal));
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask register of regulator\r\n");
    }
}

void PCA9422_GetRegulatorInterrupt(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;

    /* Read interrupt register */
    result = PCA9422_ReadRegs(handle, PCA9422_INT1, source, 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data read interrupt register of regulator\r\n");
    }
}

void PCA9422_GetRegulatorInterruptStatus(pca9422_handle_t *handle, uint8_t *status)
{
    bool result;

    /* Read interrupt status register */
    result = PCA9422_ReadRegs(handle, PCA9422_INT1_STATUS, status, 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data read interrupt status register of regulator\r\n");
    }
}

void PCA9422_EnableSublevelInterrupts(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;
    uint8_t maskVal[3];

    maskVal[0] = (uint8_t)(~(source[0] & 0xFFU)); /* SUB_INT0_MASK */
    maskVal[1] = (uint8_t)(~(source[1] & 0xFFU)); /* SUB_INT1_MASK */
    maskVal[2] = (uint8_t)(~(source[2] & 0xFFU)); /* SUB_INT2_MASK */

    /* Write mask registers */
    result = PCA9422_WriteRegs(handle, PCA9422_SUB_INT0_MASK, &maskVal[0], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask registers of sub-level\r\n");
    }
    result = PCA9422_WriteRegs(handle, PCA9422_SUB_INT1_MASK, &maskVal[1], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask registers of sub-level\r\n");
    }
    result = PCA9422_WriteRegs(handle, PCA9422_SUB_INT2_MASK, &maskVal[2], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask registers of sub-level\r\n");
    }
}

void PCA9422_DisableSublevelInterrupts(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;
    uint8_t maskVal[3] = {
        0,
    };

    (void)memcpy(source, maskVal, sizeof(maskVal));
    /* Write mask registers */
    result = PCA9422_WriteRegs(handle, PCA9422_SUB_INT0_MASK, &maskVal[0], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask registers of sub-level\r\n");
    }
    result = PCA9422_WriteRegs(handle, PCA9422_SUB_INT1_MASK, &maskVal[1], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask registers of sub-level\r\n");
    }
    result = PCA9422_WriteRegs(handle, PCA9422_SUB_INT2_MASK, &maskVal[2], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data write interrupt mask registers of sub-level\r\n");
    }
}

void PCA9422_GetSublevelInterrupts(pca9422_handle_t *handle, uint8_t *source)
{
    bool result;

    /* Read interrupt registers */
    result = PCA9422_ReadRegs(handle, PCA9422_SUB_INT0, &source[0], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data read interrupt registers of sub-level\r\n");
    }
    result = PCA9422_ReadRegs(handle, PCA9422_SUB_INT1, &source[1], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data read interrupt registers of sub-level\r\n");
    }
    result = PCA9422_ReadRegs(handle, PCA9422_SUB_INT2, &source[2], 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data read interrupt registers of sub-level\r\n");
    }
}

void PCA9422_GetToplevelInterruptStatus(pca9422_handle_t *handle, uint8_t *status)
{
    bool result;

    /* Read interrupt registers */
    result = PCA9422_ReadRegs(handle, PCA9422_TOP_INT, status, 1U);
    if (!result)
    {
        LOG_INFO("Error I2C data read interrupt registers of top-level\r\n");
    }
}
/*******************************************************************************
 * EOF
 ******************************************************************************/
